<script setup lang="ts">
useHead({
  title: 'Profile'
})
</script>

<template>
  <div>
    <h1 class="text-2xl font-[Moul]">
      Profile ប្រុសស្រី
    </h1>
    <hr class="my-2 border dark:border-gray-700" />
    <p class="font-[battambang] text-md font-semibold">
      ភ្នំពេញ៖ គណៈប្រតិភូយុវជនមកពីសមាគមជាតិចំនួន១០ក្នុងតំបន់អាស៊ានមានចំនួន២៤នាក់ គ្រូសម្របសម្រួលចំនួន៤នាក់ បានមកដល់រាជធានីភ្នំពេញ តាមព្រលានយន្តហោះអន្តរជាតិភ្នំពេញថ្ងៃទី១៦ ខែកញ្ញា ឆ្នាំ២០២៣នេះ។
     <br><br>
  អនុវត្តន៍តាមអនុសាសន៍ប្រធានកាកបាទក្រហមកម្ពុជា សម្ដេចកិត្តិព្រឹទ្ធិបណ្ឌិត ប៊ុន រ៉ានី ហ៊ុនសែន កាកបាទក្រហមកម្ពុជាបានរៀបចំក្រុមការងារយុវជនទទួលស្វាគមន៍ និងបដិសណ្ឋារកិច្ចគណបៈប្រតិភូទាំងអស់ ដោយមានមន្ត្រីទំនាក់ទំនងសម្រាប់ប្រតិភូយុវជនតាមសមាគមជាតិនីមួយៗនៅអាកាសយានដ្ឋានអន្តរជាតិភ្នំពេញ។
      <br><br>
  គួរឱ្យដឹងផងដែរថាវេទិកាយុវជនលើកទី២ និងកិច្ចប្រជុំថ្នាក់ដឹកនាំលើកទី២០ នៃសមាគមជាតិកាកបាទក្រហម អឌ្ឍចន្ទក្រហម ភូមិភាគអាស៊ីអាគ្នេយ៍នឹងត្រូវរៀបចំឡើងចាប់ពីថ្ងៃទី១៧ ដល់ថ្ងៃទី២២ ខែកញ្ញា ឆ្នាំ២០២៣។
      <br><br>
  
     កម្មវិធីវេទិកាយុវជនលើកទី២ រយៈពេល ៤ថ្ងៃនេះ មានគោលបំណងផ្ដល់ឱកាសដល់យុវជននៃសមាគម ជាតិទាំង ១១ នៅក្នុងភូមិភាគអាស៊ីអាគ្នេយ៍ ទទួលបានការបណ្តុះបណ្តាលជំនាញទំនាក់ទំនង និងការនិយាយជាសាធារណៈក្នុងភាពជាអ្នកដឹកនាំវ័យក្មេងនាពេលបច្ចុប្បន្ន និងអនាគត ព្រមទាំងពិនិត្យពិភាក្សារកបញ្ហាប្រឈមនានា ដែលកំពុងកើតមានឡើង និងរកដំណោះស្រាយថ្មីរួមគ្នាក្នុងវិស័យមនុស្សធម៌ ព្រមទាំងពង្រឹងកិច្ចសហប្រតិបត្តិការ សាមគ្គីភាពអន្តរជាតិក្នុងចលនាអន្តរជាតិកាកបាទក្រហម និងអឌ្ឍចន្ទក្រហម ភូមិភាគអាស៊ីអាគ្នេយ៍។ ក្នុងនោះ មាន កម្មវិធីពិសេសមួយ គឺពិធីដាំដើមឈើ ក្រោមអធិបតីភាពដ៏ខ្ពង់ខ្ពស់ សម្តេចកិត្តិព្រឹទ្ធបណ្ឌិត ប៊ុន រ៉ានី ហ៊ុនសែន ប្រធានកាកបាទក្រហមកម្ពុជា និងជាប្រធានកិច្ចប្រជុំថ្នាក់ដឹកនាំ មានគោលបំណងបណ្តុះនូវឆន្ទៈ និងក្តីស្រលាញ់ ចំពោះបរិស្ថាន និងការរួមចំណែកនៃការកាត់បន្ថយហានិភ័យនៃការប្រែប្រួលអាកាសធាតុ ជំរុញឱ្យមានកំណើន បរិស្ថានបៃតងថែមទៀតផង៕
    </p>
  </div>
</template>
