export default [
  {
    name: "បាត់ដំបង",
    gt: "001", //example
    ls: [
      {
        bn: "បាណន់",
        gt: "1001", //example
        bc: 1,
        c: [
          {
            cc: 1,
            cn: "កន្ទឺ ១",
            gt: "1001", //example
            d: null,
          },
          {
            cc: 2,
            cn: "កន្ទឺ ២",
            gt: "1001", //example
            d: null,
          },
          {
            cc: 3,
            cn: "បាយដំរាំ",
            d: null,
          },
          {
            cc: 4,
            cn: "ឈើទាល",
            d: null,
          },
          {
            cc: 5,
            cn: "ចែងមានជ័យ",
            d: null,
          },
          {
            cc: 6,
            cn: "ភ្នំសំពៅ",
            d: null,
          },
          {
            cc: 7,
            cn: "ស្នឹង",
            d: null,
          },
          {
            cc: 8,
            cn: "តាគ្រាម",
            d: null,
          },
        ],
      },
      {
        bn: "ថ្មគោល",
        bc: 2,
        c: [
          {
            cc: 9,
            cn: "តាពូង",
            d: null,
          },
          {
            cc: 10,
            cn: "តាម៉ឺន",
            d: null,
          },
          {
            cc: 11,
            cn: "អូរតាគី",
            d: null,
          },
          {
            cc: 12,
            cn: "ជ្រៃ",
            d: null,
          },
          {
            cc: 13,
            cn: "អន្លង់រុន",
            d: null,
          },
          {
            cc: 14,
            cn: "ជ្រោយស្តៅ",
            d: null,
          },
          {
            cc: 15,
            cn: "បឹងព្រីង",
            d: null,
          },
          {
            cc: 16,
            cn: "គោកឃ្មុំ",
            d: null,
          },
          {
            cc: 17,
            cn: "បន្សាយត្រែង",
            d: null,
          },
          {
            cc: 18,
            cn: "រូងជ្រៃ",
            d: null,
          },
        ],
      },
      {
        bn: "បាត់ដំបង",
        bc: 3,
        c: [
          {
            cc: 19,
            cn: "ទួលតាឯក",
            d: null,
          },
          {
            cc: 20,
            cn: "ព្រែកព្រះស្តេច",
            d: null,
          },
          {
            cc: 21,
            cn: "រតនៈ",
            d: null,
          },
          {
            cc: 22,
            cn: "ចំការសំរោង",
            d: null,
          },
          {
            cc: 23,
            cn: "ស្លាកែត",
            d: null,
          },
          {
            cc: 24,
            cn: "ក្តុលដូនទាវ",
            d: null,
          },
          {
            cc: 25,
            cn: "អូរម៉ាល់",
            d: null,
          },
          {
            cc: 26,
            cn: "វត្តគរ",
            d: null,
          },
          {
            cc: 27,
            cn: "អូរចារ",
            d: null,
          },
          {
            cc: 28,
            cn: "ស្វាយប៉ោ",
            d: null,
          },
        ],
      },
      {
        bn: "បវេល",
        bc: 4,
        c: [
          {
            cc: 29,
            cn: "បវេល",
            d: null,
          },
          {
            cc: 30,
            cn: "ខ្នាចរមាស",
            d: null,
          },
          {
            cc: 31,
            cn: "ល្វា",
            d: null,
          },
          {
            cc: 32,
            cn: "ព្រៃខ្ពស់",
            d: null,
          },
          {
            cc: 33,
            cn: "អំពិលប្រាំដើម",
            d: null,
          },
          {
            cc: 34,
            cn: "ក្តុលតាហែន",
            d: null,
          },
          {
            cc: 97,
            cn: "បឹងប្រាំ",
            d: null,
          },
          {
            cc: 98,
            cn: "ឃ្លាំងមាស",
            d: null,
          },
          {
            cc: 103,
            cn: "បួវិល",
            d: null,
          },
        ],
      },
      {
        bn: "ឯកភ្នំ",
        bc: 5,
        c: [
          {
            cc: 35,
            cn: "ព្រែកនរិន្ទ",
            d: null,
          },
          {
            cc: 36,
            cn: "សំរោងក្នុង",
            d: null,
          },
          {
            cc: 37,
            cn: "ព្រែកខ្ពប",
            d: null,
          },
          {
            cc: 38,
            cn: "ព្រែកហ្លួង",
            d: null,
          },
          {
            cc: 39,
            cn: "ពាមឯក",
            d: null,
          },
          {
            cc: 40,
            cn: "ព្រៃចាស់",
            d: null,
          },
          {
            cc: 41,
            cn: "កោះជីវាំង",
            d: null,
          },
        ],
      },
      {
        bn: "មោងឫស្សី",
        bc: 6,
        c: [
          {
            cc: 42,
            cn: "មោង",
            d: null,
          },
          {
            cc: 43,
            cn: "គារ",
            d: null,
          },
          {
            cc: 44,
            cn: "ព្រៃស្វាយ",
            d: null,
          },
          {
            cc: 45,
            cn: "ឫស្សីក្រាំង",
            d: null,
          },
          {
            cc: 46,
            cn: "ជ្រៃ",
            d: null,
          },
          {
            cc: 47,
            cn: "តាលាស់",
            d: null,
          },
          {
            cc: 48,
            cn: "កកោះ",
            d: null,
          },
          {
            cc: 49,
            cn: "ព្រៃតូច",
            d: null,
          },
          {
            cc: 50,
            cn: "របស់មង្គល",
            d: null,
          },
        ],
      },
      {
        bn: "រុក្ខគិរី",
        bc: 7,
        c: [
          {
            cc: 52,
            cn: "ព្រែកជីក",
            d: null,
          },
          {
            cc: 53,
            cn: "ព្រៃត្រឡាច",
            d: null,
          },
          {
            cc: 99,
            cn: "បាសាក់",
            d: null,
          },
          {
            cc: 100,
            cn: "មុខរាហ៍",
            d: null,
          },
          {
            cc: 101,
            cn: "ស្តុកប្រវឹក",
            d: null,
          },
        ],
      },
      {
        bn: "រតនមណ្ឌល",
        bc: 8,
        c: [
          {
            cc: 54,
            cn: "ស្តៅ",
            d: null,
          },
          {
            cc: 55,
            cn: "អណ្តើកហែប",
            d: null,
          },
          {
            cc: 56,
            cn: "ផ្លូវមាស",
            d: null,
          },
          {
            cc: 57,
            cn: "ត្រែង",
            d: null,
          },
          {
            cc: 102,
            cn: "រស្មីសង្ហារ",
            d: null,
          },
        ],
      },
      {
        bn: "សង្កែ",
        bc: 9,
        c: [
          {
            cc: 58,
            cn: "អន្លង់់វិល",
            d: null,
          },
          {
            cc: 59,
            cn: "នរា",
            d: null,
          },
          {
            cc: 60,
            cn: "តាប៉ុន",
            d: null,
          },
          {
            cc: 61,
            cn: "រកា",
            d: null,
          },
          {
            cc: 62,
            cn: "កំពង់ព្រះ",
            d: null,
          },
          {
            cc: 63,
            cn: "កំពង់ព្រៀង",
            d: null,
          },
          {
            cc: 64,
            cn: "រាំងកេសី",
            d: null,
          },
          {
            cc: 65,
            cn: "អូរដំបង ១",
            d: null,
          },
          {
            cc: 66,
            cn: "អូរដំបង ២",
            d: null,
          },
          {
            cc: 67,
            cn: "វត្តតាមិម",
            d: null,
          },
        ],
      },
      {
        bn: "សំឡូត",
        bc: 10,
        c: [
          {
            cc: 68,
            cn: "ស៊ុង ",
            d: null,
          },
          {
            cc: 69,
            cn: "មានជ័យ",
            d: null,
          },
          {
            cc: 70,
            cn: "សំឡូត",
            d: null,
          },
          {
            cc: 71,
            cn: "កំពង់ល្ពៅ",
            d: null,
          },
          {
            cc: 72,
            cn: "អូរសំរិល",
            d: null,
          },
          {
            cc: 73,
            cn: "តាតោក",
            d: null,
          },
          {
            cc: 95,
            cn: "តាសាញ",
            d: null,
          },
        ],
      },
      {
        bn: "សំពៅលូន",
        bc: 11,
        c: [
          {
            cc: 74,
            cn: "អង្គរបាន",
            d: null,
          },
          {
            cc: 75,
            cn: "សិរីមានជ័យ",
            d: null,
          },
          {
            cc: 76,
            cn: "សន្តិភាព",
            d: null,
          },
          {
            cc: 77,
            cn: "តាស្តា",
            d: null,
          },
          {
            cc: 78,
            cn: "សំពៅលូន",
            d: null,
          },
          {
            cc: 79,
            cn: "ជ្រៃសីមា",
            d: null,
          },
        ],
      },
      {
        bn: "ភ្នំព្រឹក",
        bc: 12,
        c: [
          {
            cc: 80,
            cn: "ភ្នំព្រឹក",
            d: null,
          },
          {
            cc: 81,
            cn: "បារាំងធ្លាក់ ",
            d: null,
          },
          {
            cc: 82,
            cn: "អូររំដួល",
            d: null,
          },
          {
            cc: 83,
            cn: "ពេជ្រចិន្តា",
            d: null,
          },
          {
            cc: 84,
            cn: "បួរ",
            d: null,
          },
        ],
      },
      {
        bn: "កំរៀង",
        bc: 13,
        c: [
          {
            cc: 85,
            cn: "កំរៀង",
            d: null,
          },
          {
            cc: 86,
            cn: "អូរដា",
            d: null,
          },
          {
            cc: 87,
            cn: "បឹងរាំង",
            d: null,
          },
          {
            cc: 88,
            cn: "ត្រាង",
            d: null,
          },
          {
            cc: 89,
            cn: "តាសែន",
            d: null,
          },
          {
            cc: 96,
            cn: "តាក្រី",
            d: null,
          },
        ],
      },
      {
        bn: "គាស់ក្រឡ",
        bc: 14,
        c: [
          {
            cc: 51,
            cn: "ធិបតី",
            d: null,
          },
          {
            cc: 90,
            cn: "ឆ្នាល់មាន់",
            d: null,
          },
          {
            cc: 91,
            cn: "ដូនបា",
            d: null,
          },
          {
            cc: 92,
            cn: "ហប់",
            d: null,
          },
          {
            cc: 93,
            cn: "គាស់ក្រឡ",
            d: null,
          },
          {
            cc: 94,
            cn: "ព្រះផុស",
            d: null,
          },
        ],
      },
    ],
  },
  {
    name: "បន្ទាយមានជ័យ",
    ls: [
      {
        bn: "មង្គលបូរី",
        bc: 1,
        c: [
          {
            cc: 1,
            cn: "បន្ទាយនាង",
            d: null,
          },
          {
            cc: 2,
            cn: "បត់ត្រង់",
            d: null,
          },
          {
            cc: 3,
            cn: "ចំណោម",
            d: null,
          },
          {
            cc: 4,
            cn: "គោកបល្ល័ង្គ",
            d: null,
          },
          {
            cc: 5,
            cn: "គយម៉ែង",
            d: null,
          },
          {
            cc: 6,
            cn: "អូរប្រាសាទ",
            d: null,
          },
          {
            cc: 7,
            cn: "ភ្នំតូច",
            d: null,
          },
          {
            cc: 8,
            cn: "រហាត់ទឹក",
            d: null,
          },
          {
            cc: 9,
            cn: "ឫស្សីក្រោក",
            d: null,
          },
          {
            cc: 10,
            cn: "សំបួរ",
            d: null,
          },
          {
            cc: 11,
            cn: "សឿ",
            d: null,
          },
          {
            cc: 12,
            cn: "ស្រះរាំង",
            d: null,
          },
          {
            cc: 13,
            cn: "តាឡំ",
            d: null,
          },
        ],
      },
      {
        bn: "ភ្នំស្រុក",
        bc: 2,
        c: [
          {
            cc: 14,
            cn: "ណាំតៅ",
            d: null,
          },
          {
            cc: 15,
            cn: "ប៉ោយចារ",
            d: null,
          },
          {
            cc: 16,
            cn: "ពន្លៃ",
            d: null,
          },
          {
            cc: 17,
            cn: "ស្ពានស្រែង",
            d: null,
          },
          {
            cc: 18,
            cn: "ស្រះជីក",
            d: null,
          },
          {
            cc: 19,
            cn: "ភ្នំដី",
            d: null,
          },
        ],
      },
      {
        bn: "ព្រះនេត្រព្រះ",
        bc: 3,
        c: [
          {
            cc: 20,
            cn: "ឈ្នួរមានជ័យ",
            d: null,
          },
          {
            cc: 21,
            cn: "ជប់វារី",
            d: null,
          },
          {
            cc: 22,
            cn: "ភ្នំលៀប",
            d: null,
          },
          {
            cc: 23,
            cn: "ប្រាសាទ",
            d: null,
          },
          {
            cc: 24,
            cn: "ព្រះនេត្រព្រះ",
            d: null,
          },
          {
            cc: 25,
            cn: "រហាល",
            d: null,
          },
          {
            cc: 26,
            cn: "ទានកាំ",
            d: null,
          },
          {
            cc: 27,
            cn: "ទឹកជោរ",
            d: null,
          },
          {
            cc: 36,
            cn: "បុស្បូវ",
            d: null,
          },
        ],
      },
      {
        bn: "អូរជ្រៅ",
        bc: 4,
        c: [
          {
            cc: 28,
            cn: "ចង្ហា",
            d: null,
          },
          {
            cc: 29,
            cn: "កូប",
            d: null,
          },
          {
            cc: 30,
            cn: "គុត្តសត",
            d: null,
          },
          {
            cc: 32,
            cn: "សំរោង",
            d: null,
          },
          {
            cc: 33,
            cn: "សូភី",
            d: null,
          },
          {
            cc: 34,
            cn: "សឹង្ហ",
            d: null,
          },
          {
            cc: 64,
            cn: "អូរបីជាន់",
            d: null,
          },
        ],
      },
      {
        bn: "ប៉ោយប៉ែត",
        bc: 5,
        c: [
          {
            cc: 31,
            cn: "និមិត្ត",
            d: null,
          },
          {
            cc: 35,
            cn: "ប៉ោយប៉ែត",
            d: null,
          },
          {
            cc: 65,
            cn: "ផ្សារកណ្តាល",
            d: null,
          },
          {
            cc: 66,
            cn: "អូរជ្រៅ",
            d: null,
          },
          {
            cc: 67,
            cn: "អូរឫស្សី",
            d: null,
          },
        ],
      },
      {
        bn: "សិរីសោភ័ណ",
        bc: 6,
        c: [
          {
            cc: 37,
            cn: "កំពង់ស្វាយ",
            d: null,
          },
          {
            cc: 38,
            cn: "កោះពងសត្វ",
            d: null,
          },
          {
            cc: 39,
            cn: "ម្កាក់",
            d: null,
          },
          {
            cc: 40,
            cn: "អូរអំបិល",
            d: null,
          },
          {
            cc: 41,
            cn: "ភ្នៀត",
            d: null,
          },
          {
            cc: 42,
            cn: "ព្រះពន្លា",
            d: null,
          },
          {
            cc: 43,
            cn: "ទឹកថ្លា",
            d: null,
          },
        ],
      },
      {
        bn: "ថ្មពួក",
        bc: 7,
        c: [
          {
            cc: 44,
            cn: "បន្ទាយឆ្មារ",
            d: null,
          },
          {
            cc: 45,
            cn: "គោករមៀត",
            d: null,
          },
          {
            cc: 46,
            cn: "ថ្មពួក",
            d: null,
          },
          {
            cc: 47,
            cn: "គោកកឋិន",
            d: null,
          },
          {
            cc: 48,
            cn: "គំរូ",
            d: null,
          },
          {
            cc: 49,
            cn: "ភូមិថ្មី",
            d: null,
          },
        ],
      },
      {
        bn: "ស្វាយចេក",
        bc: 8,
        c: [
          {
            cc: 50,
            cn: "ផ្គាំ",
            d: null,
          },
          {
            cc: 51,
            cn: "សារង្គ",
            d: null,
          },
          {
            cc: 52,
            cn: "ស្លក្រាម",
            d: null,
          },
          {
            cc: 53,
            cn: "ស្វាយចេក",
            d: null,
          },
          {
            cc: 54,
            cn: "តាបែន",
            d: null,
          },
          {
            cc: 55,
            cn: "តាផូ",
            d: null,
          },
          {
            cc: 56,
            cn: "ទ្រាស",
            d: null,
          },
          {
            cc: 57,
            cn: "រលួស",
            d: null,
          },
        ],
      },
      {
        bn: "ម៉ាឡៃ",
        bc: 9,
        c: [
          {
            cc: 58,
            cn: "បឹងបេង",
            d: null,
          },
          {
            cc: 59,
            cn: "ម៉ាឡៃ",
            d: null,
          },
          {
            cc: 60,
            cn: "អូរស្រឡៅ",
            d: null,
          },
          {
            cc: 61,
            cn: "អូរសំព័រ",
            d: null,
          },
          {
            cc: 62,
            cn: "ទួលពង្រ",
            d: null,
          },
          {
            cc: 63,
            cn: "តាគង់",
            d: null,
          },
        ],
      },
    ],
  },
  {
    name: "កំពង់ចាម",
    ls: [
      {
        bn: "បាធាយ",
        bc: 1,
        c: [
          {
            cc: 1,
            cn: "បាធាយ",
            d: null,
          },
          {
            cc: 2,
            cn: "ច្បារអំពៅ",
            d: null,
          },
          {
            cc: 3,
            cn: "ជាលា",
            d: null,
          },
          {
            cc: 4,
            cn: "ជើងព្រៃ",
            d: null,
          },
          {
            cc: 5,
            cn: "មេព្រីង",
            d: null,
          },
          {
            cc: 6,
            cn: "ផ្អាវ",
            d: null,
          },
          {
            cc: 7,
            cn: "សំបូរ",
            d: null,
          },
          {
            cc: 8,
            cn: "សណ្តែក",
            d: null,
          },
          {
            cc: 9,
            cn: "តាំងក្រាំង",
            d: null,
          },
          {
            cc: 10,
            cn: "តាំងក្រសាំង",
            d: null,
          },
          {
            cc: 11,
            cn: "ត្រប់",
            d: null,
          },
          {
            cc: 12,
            cn: "ទំនប់",
            d: null,
          },
        ],
      },
      {
        bn: "ចំការលើ",
        bc: 2,
        c: [
          {
            cc: 13,
            cn: "បុសខ្នុរ",
            d: null,
          },
          {
            cc: 14,
            cn: "ចំការអណ្តូង",
            d: null,
          },
          {
            cc: 15,
            cn: "ជយោ",
            d: null,
          },
          {
            cc: 16,
            cn: "ល្វាលើ",
            d: null,
          },
          {
            cc: 17,
            cn: "ស្ពឺ ",
            d: null,
          },
          {
            cc: 18,
            cn: "ស្វាយទាប",
            d: null,
          },
          {
            cc: 19,
            cn: "តាអុង",
            d: null,
          },
          {
            cc: 20,
            cn: "តាប្រុក",
            d: null,
          },
        ],
      },
      {
        bn: "ជើងព្រៃ",
        bc: 3,
        c: [
          {
            cc: 21,
            cn: "ខ្នុរដំបង",
            d: null,
          },
          {
            cc: 22,
            cn: "គោករវៀង",
            d: null,
          },
          {
            cc: 23,
            cn: "ផ្តៅជុំ",
            d: null,
          },
          {
            cc: 24,
            cn: "ព្រៃចារ",
            d: null,
          },
          {
            cc: 25,
            cn: "ព្រីងជ្រុំ",
            d: null,
          },
          {
            cc: 26,
            cn: "សំពងជ័យ",
            d: null,
          },
          {
            cc: 27,
            cn: "ស្តើងជ័យ",
            d: null,
          },
          {
            cc: 28,
            cn: "សូទិប",
            d: null,
          },
          {
            cc: 29,
            cn: "ស្រម៉រ",
            d: null,
          },
          {
            cc: 30,
            cn: "ត្រពាំងគរ",
            d: null,
          },
        ],
      },
      {
        bn: "កំពង់ចាម",
        bc: 4,
        c: [
          {
            cc: 31,
            cn: "បឹងកុក",
            d: null,
          },
          {
            cc: 32,
            cn: "កំពង់ចាម",
            d: null,
          },
          {
            cc: 33,
            cn: "សំបួរមាស",
            d: null,
          },
          {
            cc: 34,
            cn: "វាលវង់",
            d: null,
          },
        ],
      },
      {
        bn: "កំពង់សៀម",
        bc: 5,
        c: [
          {
            cc: 35,
            cn: "អំពិល",
            d: null,
          },
          {
            cc: 36,
            cn: "ហាន់ជ័យ",
            d: null,
          },
          {
            cc: 37,
            cn: "កៀនជ្រៃ",
            d: null,
          },
          {
            cc: 38,
            cn: "គគរ",
            d: null,
          },
          {
            cc: 39,
            cn: "កោះមិត្ត",
            d: null,
          },
          {
            cc: 40,
            cn: "កោះរកា",
            d: null,
          },
          {
            cc: 41,
            cn: "កោះសំរោង",
            d: null,
          },
          {
            cc: 42,
            cn: "កោះទន្ទឹម",
            d: null,
          },
          {
            cc: 43,
            cn: "ក្រឡា",
            d: null,
          },
          {
            cc: 44,
            cn: "អូរស្វាយ",
            d: null,
          },
          {
            cc: 45,
            cn: "រអាង",
            d: null,
          },
          {
            cc: 46,
            cn: "រំចេក",
            d: null,
          },
          {
            cc: 47,
            cn: "ស្រក",
            d: null,
          },
          {
            cc: 48,
            cn: "ទ្រាន",
            d: null,
          },
          {
            cc: 49,
            cn: "វិហារធំ",
            d: null,
          },
        ],
      },
      {
        bn: "កងមាស",
        bc: 6,
        c: [
          {
            cc: 50,
            cn: "អង្គរបាន",
            d: null,
          },
          {
            cc: 51,
            cn: "កងតាណឹង",
            d: null,
          },
          {
            cc: 52,
            cn: "ខ្ចៅ",
            d: null,
          },
          {
            cc: 53,
            cn: "ពាមជីកង",
            d: null,
          },
          {
            cc: 54,
            cn: "ព្រែកកុយ",
            d: null,
          },
          {
            cc: 55,
            cn: "ព្រែកក្របៅ",
            d: null,
          },
          {
            cc: 56,
            cn: "រាយប៉ាយ",
            d: null,
          },
          {
            cc: 57,
            cn: "រកាអារ",
            d: null,
          },
          {
            cc: 58,
            cn: "រកាគយ",
            d: null,
          },
          {
            cc: 59,
            cn: "ស្តៅ",
            d: null,
          },
          {
            cc: 60,
            cn: "សូរគង",
            d: null,
          },
        ],
      },
      {
        bn: "កោះសូទិន",
        bc: 7,
        c: [
          {
            cc: 61,
            cn: "កំពង់រាប",
            d: null,
          },
          {
            cc: 62,
            cn: "កោះសូទិន",
            d: null,
          },
          {
            cc: 63,
            cn: "ល្វេ",
            d: null,
          },
          {
            cc: 64,
            cn: "មហាលាភ",
            d: null,
          },
          {
            cc: 65,
            cn: "មហាខ្ញូង",
            d: null,
          },
          {
            cc: 66,
            cn: "ពាមប្រធ្នោះ",
            d: null,
          },
          {
            cc: 67,
            cn: "ពង្រ",
            d: null,
          },
          {
            cc: 68,
            cn: "ព្រែកតានង់",
            d: null,
          },
        ],
      },
      {
        bn: "ព្រៃឈរ",
        bc: 8,
        c: [
          {
            cc: 69,
            cn: "បារាយណ៍",
            d: null,
          },
          {
            cc: 70,
            cn: "បឹងណាយ",
            d: null,
          },
          {
            cc: 71,
            cn: "ជ្រៃវៀន",
            d: null,
          },
          {
            cc: 72,
            cn: "ខ្វិតធំ",
            d: null,
          },
          {
            cc: 73,
            cn: "គរ",
            d: null,
          },
          {
            cc: 74,
            cn: "ក្រូច",
            d: null,
          },
          {
            cc: 75,
            cn: "ល្វា",
            d: null,
          },
          {
            cc: 76,
            cn: "មៀន",
            d: null,
          },
          {
            cc: 77,
            cn: "ព្រៃឈរ",
            d: null,
          },
          {
            cc: 78,
            cn: "សូរ្យសែន",
            d: null,
          },
          {
            cc: 79,
            cn: "សំរោង",
            d: null,
          },
          {
            cc: 80,
            cn: "ស្រង៉ែ",
            d: null,
          },
          {
            cc: 81,
            cn: "ថ្មពូន",
            d: null,
          },
          {
            cc: 82,
            cn: "តុងរ៉ុង",
            d: null,
          },
          {
            cc: 83,
            cn: "ត្រពាំងព្រះ",
            d: null,
          },
        ],
      },
      {
        bn: "ស្រីសន្ធរ",
        bc: 9,
        c: [
          {
            cc: 84,
            cn: "បារាយណ៍",
            d: null,
          },
          {
            cc: 85,
            cn: "ជីបាល",
            d: null,
          },
          {
            cc: 86,
            cn: "ខ្នារស",
            d: null,
          },
          {
            cc: 87,
            cn: "កោះអណ្តែត",
            d: null,
          },
          {
            cc: 88,
            cn: "មានជ័យ",
            d: null,
          },
          {
            cc: 89,
            cn: "ផ្ទះកណ្តាល",
            d: null,
          },
          {
            cc: 90,
            cn: "ប្រាំយ៉ាម",
            d: null,
          },
          {
            cc: 91,
            cn: "ព្រែកដំបូក",
            d: null,
          },
          {
            cc: 92,
            cn: "ព្រែកពោធិ",
            d: null,
          },
          {
            cc: 93,
            cn: "ព្រែករំដេង",
            d: null,
          },
          {
            cc: 94,
            cn: "ឫស្សីស្រុក",
            d: null,
          },
          {
            cc: 95,
            cn: "ស្វាយពោធិ",
            d: null,
          },
          {
            cc: 96,
            cn: "ស្វាយខ្សាច់ភ្នំ",
            d: null,
          },
          {
            cc: 97,
            cn: "ទងត្រឡាច",
            d: null,
          },
        ],
      },
      {
        bn: "ស្ទឹងត្រង់",
        bc: 10,
        c: [
          {
            cc: 98,
            cn: "អារក្សត្នោត",
            d: null,
          },
          {
            cc: 99,
            cn: "ដងក្តារ",
            d: null,
          },
          {
            cc: 100,
            cn: "ខ្ពបតាងួន",
            d: null,
          },
          {
            cc: 101,
            cn: "មេសរជ្រៃ",
            d: null,
          },
          {
            cc: 102,
            cn: "អូរម្លូ",
            d: null,
          },
          {
            cc: 103,
            cn: "ពាមកោះស្នា",
            d: null,
          },
          {
            cc: 104,
            cn: "ព្រះអណ្តូង",
            d: null,
          },
          {
            cc: 105,
            cn: "ព្រែកបាក់",
            d: null,
          },
          {
            cc: 106,
            cn: "ព្រែកកក់",
            d: null,
          },
          {
            cc: 107,
            cn: "សូភាស",
            d: null,
          },
          {
            cc: 108,
            cn: "ទួលព្រះឃ្លាំង",
            d: null,
          },
          {
            cc: 109,
            cn: "ទួលសំបួរ",
            d: null,
          },
        ],
      },
    ],
  },
  {
    name: "កំពង់ឆ្នាំ",
    ls: [
      {
        bn: "បរិបូណ៌",
        bc: 1,
        c: [
          {
            cc: 1,
            cn: "អញ្ចាញរូង",
            d: null,
          },
          {
            cc: 2,
            cn: "ឆ្នុកទ្រូ",
            d: null,
          },
          {
            cc: 3,
            cn: "ចក",
            d: null,
          },
          {
            cc: 4,
            cn: "ខុនរ៉ង",
            d: null,
          },
          {
            cc: 5,
            cn: "កំពង់ព្រះគគីរ",
            d: null,
          },
          {
            cc: 6,
            cn: "មេលំ",
            d: null,
          },
          {
            cc: 7,
            cn: "ផ្សារ",
            d: null,
          },
          {
            cc: 8,
            cn: "ពេជចង្វារ",
            d: null,
          },
          {
            cc: 9,
            cn: "ពពេល",
            d: null,
          },
          {
            cc: 10,
            cn: "ពន្លៃ",
            d: null,
          },
          {
            cc: 11,
            cn: "ត្រពាំងចាន់",
            d: null,
          },
        ],
      },
      {
        bn: "ជលគីរី",
        bc: 2,
        c: [
          {
            cc: 12,
            cn: "ជលសា",
            d: null,
          },
          {
            cc: 13,
            cn: "កោះថ្កូវ",
            d: null,
          },
          {
            cc: 14,
            cn: "កំពង់អុស",
            d: null,
          },
          {
            cc: 15,
            cn: "ពាមឆ្កោក",
            d: null,
          },
          {
            cc: 16,
            cn: "ព្រៃគ្រី",
            d: null,
          },
        ],
      },
      {
        bn: "កំពង់ឆ្នាំង",
        bc: 3,
        c: [
          {
            cc: 17,
            cn: "ផ្សារឆ្នាំង",
            d: null,
          },
          {
            cc: 18,
            cn: "កំពង់ឆ្នាំង",
            d: null,
          },
          {
            cc: 19,
            cn: "ប្អេរ",
            d: null,
          },
          {
            cc: 20,
            cn: "ខ្សាម",
            d: null,
          },
        ],
      },
      {
        bn: "កំពង់លែង",
        bc: 4,
        c: [
          {
            cc: 21,
            cn: "ច្រណូក",
            d: null,
          },
          {
            cc: 22,
            cn: "ដារ",
            d: null,
          },
          {
            cc: 23,
            cn: "កំពង់ហៅ",
            d: null,
          },
          {
            cc: 24,
            cn: "ផ្លូវទូក",
            d: null,
          },
          {
            cc: 25,
            cn: "ពោធិ៍",
            d: null,
          },
          {
            cc: 26,
            cn: "ប្រឡាយមាស",
            d: null,
          },
          {
            cc: 27,
            cn: "សំរោងសែន",
            d: null,
          },
          {
            cc: 28,
            cn: "ស្វាយរំពារ",
            d: null,
          },
          {
            cc: 29,
            cn: "ត្រងិល",
            d: null,
          },
        ],
      },
      {
        bn: "កំពង់ត្រឡាច",
        bc: 5,
        c: [
          {
            cc: 30,
            cn: "អំពិលទឹក",
            d: null,
          },
          {
            cc: 31,
            cn: "ឈូក ស",
            d: null,
          },
          {
            cc: 32,
            cn: "ច្រេស",
            d: null,
          },
          {
            cc: 33,
            cn: "កំពង់ត្រឡាច",
            d: null,
          },
          {
            cc: 34,
            cn: "លង្វែក",
            d: null,
          },
          {
            cc: 35,
            cn: "អូរឫស្សី",
            d: null,
          },
          {
            cc: 36,
            cn: "ពានី",
            d: null,
          },
          {
            cc: 37,
            cn: "សែប",
            d: null,
          },
          {
            cc: 38,
            cn: "តាជេស",
            d: null,
          },
          {
            cc: 39,
            cn: "ថ្មឥដ្ឋ",
            d: null,
          },
        ],
      },
      {
        bn: "រលាប្អៀរ",
        bc: 6,
        c: [
          {
            cc: 40,
            cn: "អណ្តូងស្នាយ",
            d: null,
          },
          {
            cc: 41,
            cn: "បន្ទាយព្រាល",
            d: null,
          },
          {
            cc: 42,
            cn: "ជើងគ្រាវ",
            d: null,
          },
          {
            cc: 43,
            cn: "ជ្រៃបាក់",
            d: null,
          },
          {
            cc: 44,
            cn: "គោកបន្ទាយ",
            d: null,
          },
          {
            cc: 45,
            cn: "ក្រាំងលាវ",
            d: null,
          },
          {
            cc: 46,
            cn: "ពង្រ",
            d: null,
          },
          {
            cc: 47,
            cn: "ប្រស្នឹប",
            d: null,
          },
          {
            cc: 48,
            cn: "ព្រៃមូល",
            d: null,
          },
          {
            cc: 49,
            cn: "រលាប្អៀរ",
            d: null,
          },
          {
            cc: 50,
            cn: "ស្រែថ្មី",
            d: null,
          },
          {
            cc: 51,
            cn: "ស្វាយជ្រុំ",
            d: null,
          },
          {
            cc: 52,
            cn: "ទឹកហូត",
            d: null,
          },
          {
            cc: 71,
            cn: "ភ្នំក្រាំងដីមាស",
            d: null,
          },
        ],
      },
      {
        bn: "សាមគ្គីមានជ័យ",
        bc: 7,
        c: [
          {
            cc: 53,
            cn: "ឈានឡើង",
            d: null,
          },
          {
            cc: 54,
            cn: "ខ្នារឆ្មារ",
            d: null,
          },
          {
            cc: 55,
            cn: "ក្រាំងល្វា",
            d: null,
          },
          {
            cc: 56,
            cn: "ពាម",
            d: null,
          },
          {
            cc: 57,
            cn: "សេដ្ឋី",
            d: null,
          },
          {
            cc: 58,
            cn: "ស្វាយ",
            d: null,
          },
          {
            cc: 59,
            cn: "ស្វាយជុក",
            d: null,
          },
          {
            cc: 60,
            cn: "ត្បែងខ្ពស់",
            d: null,
          },
          {
            cc: 61,
            cn: "ធ្លកវៀន",
            d: null,
          },
        ],
      },
      {
        bn: "ទឹកផុស",
        bc: 8,
        c: [
          {
            cc: 62,
            cn: "អភិវឌ្ឍន៍",
            d: null,
          },
          {
            cc: 63,
            cn: "ជៀប",
            d: null,
          },
          {
            cc: 64,
            cn: "ចោងម៉ោង",
            d: null,
          },
          {
            cc: 65,
            cn: "ក្បាលទឹក",
            d: null,
          },
          {
            cc: 66,
            cn: "ខ្លុងពពក",
            d: null,
          },
          {
            cc: 67,
            cn: "ក្រាំងស្គារ",
            d: null,
          },
          {
            cc: 68,
            cn: "តាំងក្រសាំង",
            d: null,
          },
          {
            cc: 69,
            cn: "ទួលខ្ពស់",
            d: null,
          },
          {
            cc: 70,
            cn: "ក្តុលសែនជ័យ",
            d: null,
          },
        ],
      },
    ],
  },
  {
    name: "កំពង់ស្ពឺ",
    ls: [
      {
        bn: "បសេដ្ឋ",
        bc: 1,
        c: [
          {
            cc: 1,
            cn: "បសេដ្ឋ",
            d: null,
          },
          {
            cc: 2,
            cn: "កាត់ភ្លុក",
            d: null,
          },
          {
            cc: 3,
            cn: "និទាន",
            d: null,
          },
          {
            cc: 4,
            cn: "ភក្តី",
            d: null,
          },
          {
            cc: 5,
            cn: "ភារីមានជ័យ",
            d: null,
          },
          {
            cc: 6,
            cn: "ផុង",
            d: null,
          },
          {
            cc: 7,
            cn: "ពោធិអង្ក្រង",
            d: null,
          },
          {
            cc: 8,
            cn: "ពោធិ៍ចំរើន",
            d: null,
          },
          {
            cc: 9,
            cn: "ពោធិ៍ម្រាល",
            d: null,
          },
          {
            cc: 10,
            cn: "ស្វាយចចិប",
            d: null,
          },
          {
            cc: 11,
            cn: "ទួលអំពិល",
            d: null,
          },
          {
            cc: 12,
            cn: "ទួលសាលា",
            d: null,
          },
          {
            cc: 13,
            cn: "កក់",
            d: null,
          },
          {
            cc: 14,
            cn: "ស្វាយរំពារ",
            d: null,
          },
          {
            cc: 15,
            cn: "ព្រះខែ",
            d: null,
          },
        ],
      },
      {
        bn: "ច្បារមន",
        bc: 2,
        c: [
          {
            cc: 16,
            cn: "ច្បារមន",
            d: null,
          },
          {
            cc: 17,
            cn: "កណ្តោលដុំ",
            d: null,
          },
          {
            cc: 18,
            cn: "រការធំ",
            d: null,
          },
          {
            cc: 19,
            cn: "សុព័រទេព",
            d: null,
          },
          {
            cc: 20,
            cn: "ស្វាយក្រវ៉ាន់",
            d: null,
          },
        ],
      },
      {
        bn: "គងពិសី",
        bc: 3,
        c: [
          {
            cc: 21,
            cn: "អង្គពពេល",
            d: null,
          },
          {
            cc: 22,
            cn: "ជង្រុក",
            d: null,
          },
          {
            cc: 23,
            cn: "មហាឫស្សី",
            d: null,
          },
          {
            cc: 24,
            cn: "ពេជ្រមុនី",
            d: null,
          },
          {
            cc: 25,
            cn: "ព្រះនិព្វាន",
            d: null,
          },
          {
            cc: 26,
            cn: "ព្រៃញាតិ",
            d: null,
          },
          {
            cc: 27,
            cn: "ព្រៃវិហារ",
            d: null,
          },
          {
            cc: 28,
            cn: "រកាកោះ",
            d: null,
          },
          {
            cc: 29,
            cn: "ស្តុក",
            d: null,
          },
          {
            cc: 30,
            cn: "ស្នំក្រពើ",
            d: null,
          },
          {
            cc: 31,
            cn: "ស្រង់",
            d: null,
          },
          {
            cc: 32,
            cn: "ទឹកល្អក់",
            d: null,
          },
          {
            cc: 33,
            cn: "វាល",
            d: null,
          },
        ],
      },
      {
        bn: "ឱរ៉ាល់",
        bc: 4,
        c: [
          {
            cc: 34,
            cn: "ហោងសំណំ",
            d: null,
          },
          {
            cc: 35,
            cn: "រស្មីសាមគ្គី",
            d: null,
          },
          {
            cc: 36,
            cn: "ត្រពាំងជោ",
            d: null,
          },
          {
            cc: 37,
            cn: "សង្កែសាទប",
            d: null,
          },
          {
            cc: 38,
            cn: "តាសាល",
            d: null,
          },
        ],
      },
      {
        bn: "សាមគ្គីមុនីជ័យ",
        bc: 5,
        c: [
          {
            cc: 39,
            cn: "ចាន់សែន",
            d: null,
          },
          {
            cc: 40,
            cn: "ជើងរាស់",
            d: null,
          },
          {
            cc: 41,
            cn: "ជំពូព្រឹក្ស",
            d: null,
          },
          {
            cc: 43,
            cn: "ក្រាំងចេក",
            d: null,
          },
          {
            cc: 44,
            cn: "មានជ័យ",
            d: null,
          },
          {
            cc: 46,
            cn: "ព្រៃក្រសាំង",
            d: null,
          },
          {
            cc: 50,
            cn: "យុទ្ធសាមគ្គី",
            d: null,
          },
          {
            cc: 51,
            cn: "ដំណាក់រាំង",
            d: null,
          },
          {
            cc: 52,
            cn: "ពាំងល្វា",
            d: null,
          },
          {
            cc: 53,
            cn: "ភ្នំតូច",
            d: null,
          },
        ],
      },
      {
        bn: "ភ្នំស្រួច",
        bc: 6,
        c: [
          {
            cc: 54,
            cn: "ចំបក់",
            d: null,
          },
          {
            cc: 55,
            cn: "ជាំសង្កែ",
            d: null,
          },
          {
            cc: 56,
            cn: "ដំបូករូង",
            d: null,
          },
          {
            cc: 57,
            cn: "គីរីវន្ត",
            d: null,
          },
          {
            cc: 58,
            cn: "ក្រាំងដីវ៉ាយ",
            d: null,
          },
          {
            cc: 59,
            cn: "មហាសាំង",
            d: null,
          },
          {
            cc: 60,
            cn: "អូរ",
            d: null,
          },
          {
            cc: 61,
            cn: "ព្រៃរំដួល",
            d: null,
          },
          {
            cc: 62,
            cn: "ព្រៃក្មេង",
            d: null,
          },
          {
            cc: 63,
            cn: "តាំងសំរោង",
            d: null,
          },
          {
            cc: 64,
            cn: "តាំងស្យា",
            d: null,
          },
          {
            cc: 65,
            cn: "ត្រែងត្រយឹង",
            d: null,
          },
          {
            cc: 88,
            cn: "យាយម៉ៅពេជ្រនិល",
            d: null,
          },
        ],
      },
      {
        bn: "សំរោងទង",
        bc: 7,
        c: [
          {
            cc: 66,
            cn: "រលាំងចក",
            d: null,
          },
          {
            cc: 67,
            cn: "កាហែង",
            d: null,
          },
          {
            cc: 68,
            cn: "ខ្ទុំក្រាំង",
            d: null,
          },
          {
            cc: 69,
            cn: "ក្រាំងអំពិល",
            d: null,
          },
          {
            cc: 70,
            cn: "ព្នាយ",
            d: null,
          },
          {
            cc: 71,
            cn: "រលាំងគ្រើល",
            d: null,
          },
          {
            cc: 72,
            cn: "សំរោងទង",
            d: null,
          },
          {
            cc: 73,
            cn: "សំបូរ",
            d: null,
          },
          {
            cc: 74,
            cn: "សែនដី",
            d: null,
          },
          {
            cc: 75,
            cn: "ស្គុះ",
            d: null,
          },
          {
            cc: 76,
            cn: "តាំងក្រូច",
            d: null,
          },
          {
            cc: 77,
            cn: "ធម្មតាអរ",
            d: null,
          },
          {
            cc: 78,
            cn: "ត្រពាំងគង",
            d: null,
          },
          {
            cc: 79,
            cn: "ទំព័រមាស",
            d: null,
          },
          {
            cc: 80,
            cn: "វល្លិសរ",
            d: null,
          },
        ],
      },
      {
        bn: "ថ្ពង",
        bc: 8,
        c: [
          {
            cc: 81,
            cn: "អមលាំង",
            d: null,
          },
          {
            cc: 82,
            cn: "មនោរម្យ",
            d: null,
          },
          {
            cc: 83,
            cn: "ប្រាំបីមុម",
            d: null,
          },
          {
            cc: 84,
            cn: "រុងរឿង",
            d: null,
          },
          {
            cc: 85,
            cn: "ទ័ពមាន",
            d: null,
          },
          {
            cc: 86,
            cn: "វាលពន់",
            d: null,
          },
          {
            cc: 87,
            cn: "យាអង្គ",
            d: null,
          },
        ],
      },
      {
        bn: "ឧដុង្គម៉ែជ័យ",
        bc: 9,
        c: [
          {
            cc: 42,
            cn: "ក្សេមក្សាន្ត",
            d: null,
          },
          {
            cc: 45,
            cn: "ព្រះស្រែ",
            d: null,
          },
          {
            cc: 47,
            cn: "ត្រាចទង",
            d: null,
          },
          {
            cc: 48,
            cn: "វាលពង់",
            d: null,
          },
          {
            cc: 49,
            cn: "វាំងចាស់",
            d: null,
          },
        ],
      },
    ],
  },
  {
    name: "កំពង់ធំ",
    ls: [
      {
        bn: "បារាយណ៍",
        bc: 1,
        c: [
          {
            cc: 1,
            cn: "បាក់ស្នា",
            d: null,
          },
          {
            cc: 2,
            cn: "បល្ល័ង្គ",
            d: null,
          },
          {
            cc: 3,
            cn: "បារាយណ៍",
            d: null,
          },
          {
            cc: 4,
            cn: "បឹង",
            d: null,
          },
          {
            cc: 5,
            cn: "ចើងដើង",
            d: null,
          },
          {
            cc: 7,
            cn: "ឈូកខ្សាច់",
            d: null,
          },
          {
            cc: 8,
            cn: "ចុងដូង",
            d: null,
          },
          {
            cc: 10,
            cn: "គគីធំ",
            d: null,
          },
          {
            cc: 11,
            cn: "ក្រវ៉ា",
            d: null,
          },
          {
            cc: 17,
            cn: "ត្នោតជុំ",
            d: null,
          },
        ],
      },
      {
        bn: "កំពង់ស្វាយ",
        bc: 2,
        c: [
          {
            cc: 19,
            cn: "ជ័យ",
            d: null,
          },
          {
            cc: 20,
            cn: "ដំរីស្លាប់",
            d: null,
          },
          {
            cc: 21,
            cn: "កំពង់គោ",
            d: null,
          },
          {
            cc: 22,
            cn: "កំពង់ស្វាយ",
            d: null,
          },
          {
            cc: 23,
            cn: "នីពេជ",
            d: null,
          },
          {
            cc: 24,
            cn: "ផាត់សណ្តាយ",
            d: null,
          },
          {
            cc: 25,
            cn: "សាន់គ",
            d: null,
          },
          {
            cc: 26,
            cn: "ត្បែង",
            d: null,
          },
          {
            cc: 27,
            cn: "ត្រពាំងឫស្សី",
            d: null,
          },
          {
            cc: 32,
            cn: "ក្តីដូង",
            d: null,
          },
          {
            cc: 34,
            cn: "ព្រៃគុយ",
            d: null,
          },
        ],
      },
      {
        bn: "ស្ទឹងសែន",
        bc: 3,
        c: [
          {
            cc: 28,
            cn: "ដំរីជាន់ខ្លា",
            d: null,
          },
          {
            cc: 29,
            cn: "កំពង់ធំ",
            d: null,
          },
          {
            cc: 30,
            cn: "កំពង់រទេះ",
            d: null,
          },
          {
            cc: 31,
            cn: "អូរកន្ធរ",
            d: null,
          },
          {
            cc: 33,
            cn: "កំពង់ក្របៅ",
            d: null,
          },
          {
            cc: 35,
            cn: "ព្រៃតាហ៊ូ",
            d: null,
          },
          {
            cc: 36,
            cn: "អាចារ្យលាក់",
            d: null,
          },
          {
            cc: 37,
            cn: "ស្រយ៉ូវ",
            d: null,
          },
        ],
      },
      {
        bn: "ប្រាសាទបល្ល័ង្គ",
        bc: 4,
        c: [
          {
            cc: 39,
            cn: "ដូង",
            d: null,
          },
          {
            cc: 40,
            cn: "ក្រយា",
            d: null,
          },
          {
            cc: 41,
            cn: "ផាន់ញើម",
            d: null,
          },
          {
            cc: 42,
            cn: "សាគ្រាម",
            d: null,
          },
          {
            cc: 43,
            cn: "សាលាវិស័យ",
            d: null,
          },
          {
            cc: 44,
            cn: "សាមគ្គី",
            d: null,
          },
          {
            cc: 45,
            cn: "ទួលគ្រើល",
            d: null,
          },
        ],
      },
      {
        bn: "ប្រាសាទសំបូរ",
        bc: 5,
        c: [
          {
            cc: 46,
            cn: "ឈូក",
            d: null,
          },
          {
            cc: 47,
            cn: "គោល",
            d: null,
          },
          {
            cc: 48,
            cn: "សំបូរណ៍",
            d: null,
          },
          {
            cc: 49,
            cn: "ស្រើង",
            d: null,
          },
          {
            cc: 50,
            cn: "តាំងក្រសៅ",
            d: null,
          },
        ],
      },
      {
        bn: "សណ្តាន់",
        bc: 6,
        c: [
          {
            cc: 51,
            cn: "ឈើទាល",
            d: null,
          },
          {
            cc: 52,
            cn: "ដងកាំបិត",
            d: null,
          },
          {
            cc: 53,
            cn: "ក្លែង",
            d: null,
          },
          {
            cc: 54,
            cn: "មានរិទ្ធ",
            d: null,
          },
          {
            cc: 55,
            cn: "មានជ័យ",
            d: null,
          },
          {
            cc: 56,
            cn: "ងន",
            d: null,
          },
          {
            cc: 57,
            cn: "សណ្តាន់",
            d: null,
          },
          {
            cc: 58,
            cn: "សុចិត្រ",
            d: null,
          },
          {
            cc: 59,
            cn: "ទំរីង",
            d: null,
          },
        ],
      },
      {
        bn: "សន្ទុក",
        bc: 7,
        c: [
          {
            cc: 38,
            cn: "ត្បូងក្រពើ",
            d: null,
          },
          {
            cc: 60,
            cn: "បឹងល្វា",
            d: null,
          },
          {
            cc: 61,
            cn: "ជ្រាប់",
            d: null,
          },
          {
            cc: 62,
            cn: "កំពង់ថ្ម",
            d: null,
          },
          {
            cc: 63,
            cn: "កកោះ",
            d: null,
          },
          {
            cc: 64,
            cn: "ក្រយា",
            d: null,
          },
          {
            cc: 65,
            cn: "ព្នៅ",
            d: null,
          },
          {
            cc: 66,
            cn: "ប្រាសាទ",
            d: null,
          },
          {
            cc: 67,
            cn: "តាំងក្រសាំង",
            d: null,
          },
          {
            cc: 68,
            cn: "ទីពោ",
            d: null,
          },
        ],
      },
      {
        bn: "ស្ទោង",
        bc: 8,
        c: [
          {
            cc: 69,
            cn: "បន្ទាយស្ទោង",
            d: null,
          },
          {
            cc: 70,
            cn: "ចំណាក្រោម",
            d: null,
          },
          {
            cc: 71,
            cn: "ចំណាលើ",
            d: null,
          },
          {
            cc: 72,
            cn: "កំពង់ចិនជើង",
            d: null,
          },
          {
            cc: 73,
            cn: "កំពង់ចិនត្បូង",
            d: null,
          },
          {
            cc: 74,
            cn: "ម្សាក្រង",
            d: null,
          },
          {
            cc: 75,
            cn: "ពាមបាង",
            d: null,
          },
          {
            cc: 76,
            cn: "ពពក",
            d: null,
          },
          {
            cc: 77,
            cn: "ប្រឡាយ",
            d: null,
          },
          {
            cc: 78,
            cn: "ព្រះដំរី",
            d: null,
          },
          {
            cc: 79,
            cn: "រុងរឿង",
            d: null,
          },
          {
            cc: 80,
            cn: "សំព្រោជ",
            d: null,
          },
          {
            cc: 81,
            cn: "ទ្រា",
            d: null,
          },
        ],
      },
      {
        bn: "តាំងគោក",
        bc: 9,
        c: [
          {
            cc: 6,
            cn: "ច្រនាង",
            d: null,
          },
          {
            cc: 9,
            cn: "ជ្រលង",
            d: null,
          },
          {
            cc: 12,
            cn: "អណ្តូងពោធិ៍",
            d: null,
          },
          {
            cc: 13,
            cn: "ពង្រ",
            d: null,
          },
          {
            cc: 14,
            cn: "សូយោង",
            d: null,
          },
          {
            cc: 15,
            cn: "ស្រឡៅ",
            d: null,
          },
          {
            cc: 16,
            cn: "ស្វាយភ្លើង",
            d: null,
          },
          {
            cc: 18,
            cn: "ទ្រៀល",
            d: null,
          },
        ],
      },
    ],
  },
  {
    name: "កំពត",
    ls: [
      {
        bn: "អង្គរជ័យ",
        bc: 1,
        c: [
          {
            cc: 1,
            cn: "អង្គភ្នំតូច",
            d: null,
          },
          {
            cc: 2,
            cn: "អង្គរជ័យ",
            d: null,
          },
          {
            cc: 3,
            cn: "ចំប៉ី",
            d: null,
          },
          {
            cc: 4,
            cn: "ដំបូកខ្ពស់",
            d: null,
          },
          {
            cc: 5,
            cn: "ដានគោម",
            d: null,
          },
          {
            cc: 6,
            cn: "ដើមដូង",
            d: null,
          },
          {
            cc: 7,
            cn: "ម្រោម",
            d: null,
          },
          {
            cc: 8,
            cn: "ភ្នំកុង",
            d: null,
          },
          {
            cc: 9,
            cn: "ប្រភ្នំ",
            d: null,
          },
          {
            cc: 10,
            cn: "សំឡាញ",
            d: null,
          },
          {
            cc: 11,
            cn: "តានី",
            d: null,
          },
        ],
      },
      {
        bn: "បន្ទាយមាស",
        bc: 2,
        c: [
          {
            cc: 12,
            cn: "បន្ទាយមាសខាងកើត",
            d: null,
          },
          {
            cc: 13,
            cn: "បន្ទាយមាសខាងលិច",
            d: null,
          },
          {
            cc: 14,
            cn: "ព្រៃទន្លេ",
            d: null,
          },
          {
            cc: 15,
            cn: "សំរោងក្រោម",
            d: null,
          },
          {
            cc: 16,
            cn: "សំរោងលើ",
            d: null,
          },
          {
            cc: 17,
            cn: "ស្តេចគង់ខាងជើង",
            d: null,
          },
          {
            cc: 18,
            cn: "ស្តេចគង់ខាងលិច",
            d: null,
          },
          {
            cc: 19,
            cn: "ស្តេចគង់ខាងត្បូង",
            d: null,
          },
          {
            cc: 20,
            cn: "ត្នោតចុងស្រង់",
            d: null,
          },
          {
            cc: 21,
            cn: "ត្រពាំងសាលាខាងកើត",
            d: null,
          },
          {
            cc: 22,
            cn: "ត្រពាំងសាលាខាងលិច",
            d: null,
          },
          {
            cc: 23,
            cn: "ទូកមាសខាងកើត",
            d: null,
          },
          {
            cc: 24,
            cn: "ទូកមាសខាងលិច",
            d: null,
          },
          {
            cc: 25,
            cn: "វត្តអង្គខាងជើង",
            d: null,
          },
          {
            cc: 26,
            cn: "វត្តអង្គខាងត្បូង",
            d: null,
          },
        ],
      },
      {
        bn: "ឈូក",
        bc: 3,
        c: [
          {
            cc: 27,
            cn: "បានៀវ",
            d: null,
          },
          {
            cc: 28,
            cn: "បឹងនិមល",
            d: null,
          },
          {
            cc: 29,
            cn: "ឈូក",
            d: null,
          },
          {
            cc: 30,
            cn: "ដូនយ៉យ",
            d: null,
          },
          {
            cc: 31,
            cn: "ក្រាំងស្បូវ",
            d: null,
          },
          {
            cc: 32,
            cn: "ក្រាំងស្នាយ",
            d: null,
          },
          {
            cc: 33,
            cn: "ល្បើក",
            d: null,
          },
          {
            cc: 34,
            cn: "មានជ័យ",
            d: null,
          },
          {
            cc: 35,
            cn: "នារាយណ៍",
            d: null,
          },
          {
            cc: 36,
            cn: "សត្វពង",
            d: null,
          },
          {
            cc: 37,
            cn: "ត្រពាំងបី",
            d: null,
          },
          {
            cc: 38,
            cn: "ត្រមែង",
            d: null,
          },
          {
            cc: 91,
            cn: "តាកែន",
            d: null,
          },
          {
            cc: 92,
            cn: "ត្រពាំងភ្លាំង",
            d: null,
          },
          {
            cc: 93,
            cn: "តេជោអភិវឌ្ឍន៍",
            d: null,
          },
        ],
      },
      {
        bn: "ជុំគិរី",
        bc: 4,
        c: [
          {
            cc: 39,
            cn: "ច្រេស",
            d: null,
          },
          {
            cc: 40,
            cn: "ជំពូវន្ត",
            d: null,
          },
          {
            cc: 41,
            cn: "ស្នាយអញ្ជិត",
            d: null,
          },
          {
            cc: 42,
            cn: "ស្រែចែង",
            d: null,
          },
          {
            cc: 43,
            cn: "ស្រែក្នុង",
            d: null,
          },
          {
            cc: 44,
            cn: "ស្រែសំរោង",
            d: null,
          },
          {
            cc: 45,
            cn: "ត្រពាំងរាំង",
            d: null,
          },
        ],
      },
      {
        bn: "ដងទង់",
        bc: 5,
        c: [
          {
            cc: 46,
            cn: "ដំណាក់សុក្រំ",
            d: null,
          },
          {
            cc: 47,
            cn: "ដងទង់",
            d: null,
          },
          {
            cc: 48,
            cn: "ខ្ជាយខាងជើង",
            d: null,
          },
          {
            cc: 49,
            cn: "ខ្ជាយខាងត្បូង",
            d: null,
          },
          {
            cc: 50,
            cn: "មានរិទ្ធិ",
            d: null,
          },
          {
            cc: 51,
            cn: "ស្រែជាខាងជើង",
            d: null,
          },
          {
            cc: 52,
            cn: "ស្រែជាខាងត្បូង",
            d: null,
          },
          {
            cc: 53,
            cn: "ទទុង",
            d: null,
          },
          {
            cc: 54,
            cn: "អង្គ រមាស",
            d: null,
          },
          {
            cc: 55,
            cn: "ល្អាង",
            d: null,
          },
        ],
      },
      {
        bn: "កំពង់ត្រាច",
        bc: 6,
        c: [
          {
            cc: 56,
            cn: "បឹងសាលាខាងជើង",
            d: null,
          },
          {
            cc: 57,
            cn: "បឹងសាលាខាងត្បូង",
            d: null,
          },
          {
            cc: 58,
            cn: "ដំណាក់កន្ទួតខាងជើង",
            d: null,
          },
          {
            cc: 59,
            cn: "ដំណាក់កន្ទួតខាងត្បូង",
            d: null,
          },
          {
            cc: 60,
            cn: "កំពង់ត្រាចខាងកើត",
            d: null,
          },
          {
            cc: 61,
            cn: "កំពង់ត្រាចខាងលិច",
            d: null,
          },
          {
            cc: 62,
            cn: "ប្រាសាទភ្នំខ្យង",
            d: null,
          },
          {
            cc: 63,
            cn: "ភ្នំប្រាសាទ",
            d: null,
          },
          {
            cc: 64,
            cn: "អង្គសុរភី",
            d: null,
          },
          {
            cc: 65,
            cn: "ព្រែកក្រឹស",
            d: null,
          },
          {
            cc: 66,
            cn: "ឫស្សីស្រុកខាងកើត",
            d: null,
          },
          {
            cc: 67,
            cn: "ឫស្សីស្រុកខាងលិច",
            d: null,
          },
          {
            cc: 68,
            cn: "ស្វាយទងខាងជើង",
            d: null,
          },
          {
            cc: 69,
            cn: "ស្វាយទងខាងត្បូង",
            d: null,
          },
        ],
      },
      {
        bn: "ទឹកឈូ",
        bc: 7,
        c: [
          {
            cc: 71,
            cn: "ជុំគ្រៀល",
            d: null,
          },
          {
            cc: 72,
            cn: "កំពង់ក្រែង",
            d: null,
          },
          {
            cc: 73,
            cn: "កំពង់សំរោង",
            d: null,
          },
          {
            cc: 74,
            cn: "កណ្តោល",
            d: null,
          },
          {
            cc: 76,
            cn: "កូនសត្វ",
            d: null,
          },
          {
            cc: 77,
            cn: "ម៉ាក់ប្រាង្គ",
            d: null,
          },
          {
            cc: 79,
            cn: "ព្រៃឃ្មុំ",
            d: null,
          },
          {
            cc: 80,
            cn: "ព្រៃថ្នង",
            d: null,
          },
          {
            cc: 81,
            cn: "ស្ទឹងកែវ",
            d: null,
          },
          {
            cc: 82,
            cn: "ថ្មី",
            d: null,
          },
          {
            cc: 83,
            cn: "ត្រពាំងព្រីង",
            d: null,
          },
          {
            cc: 84,
            cn: "ត្រពាំងសង្កែ",
            d: null,
          },
          {
            cc: 85,
            cn: "ត្រពាំងធំ",
            d: null,
          },
        ],
      },
      {
        bn: "កំពត",
        bc: 8,
        c: [
          {
            cc: 86,
            cn: "កំពង់កណ្តាល",
            d: null,
          },
          {
            cc: 87,
            cn: "ក្រាំងអំពិល",
            d: null,
          },
          {
            cc: 88,
            cn: "កំពង់បាយ",
            d: null,
          },
          {
            cc: 89,
            cn: "អណ្តូងខ្មែរ",
            d: null,
          },
          {
            cc: 90,
            cn: "ត្រើយកោះ",
            d: null,
          },
        ],
      },
      {
        bn: "បូកគោ",
        bc: 9,
        c: [
          {
            cc: 70,
            cn: "បឹងទូក",
            d: null,
          },
          {
            cc: 75,
            cn: "កោះតូច",
            d: null,
          },
          {
            cc: 78,
            cn: "ព្រែកត្នោត",
            d: null,
          },
        ],
      },
    ],
  },
  {
    name: "កណ្តាល",
    ls: [
      {
        bn: "កណ្តាលស្ទឹង",
        bc: 1,
        c: [
          {
            cc: 1,
            cn: "អំពៅព្រៃ",
            d: null,
          },
          {
            cc: 2,
            cn: "អន្លង់រមៀត",
            d: null,
          },
          {
            cc: 3,
            cn: "បារគូ",
            d: null,
          },
          {
            cc: 4,
            cn: "បឹងខ្យាង",
            d: null,
          },
          {
            cc: 5,
            cn: "ជើងកើប",
            d: null,
          },
          {
            cc: 6,
            cn: "ដើមឫស",
            d: null,
          },
          {
            cc: 7,
            cn: "កណ្តោក",
            d: null,
          },
          {
            cc: 8,
            cn: "ថ្មី",
            d: null,
          },
          {
            cc: 9,
            cn: "គោកត្រប់",
            d: null,
          },
          {
            cc: 11,
            cn: "ព្រះពុទ្ធ",
            d: null,
          },
          {
            cc: 13,
            cn: "ព្រែករកា",
            d: null,
          },
          {
            cc: 14,
            cn: "ព្រែកស្លែង",
            d: null,
          },
          {
            cc: 15,
            cn: "រកា",
            d: null,
          },
          {
            cc: 16,
            cn: "រលាំងកែន",
            d: null,
          },
          {
            cc: 18,
            cn: "សៀមរាប",
            d: null,
          },
          {
            cc: 20,
            cn: "ត្បែង",
            d: null,
          },
          {
            cc: 22,
            cn: "ត្រពាំងវែង",
            d: null,
          },
          {
            cc: 23,
            cn: "ទ្រា",
            d: null,
          },
        ],
      },
      {
        bn: "កៀនស្វាយ",
        bc: 2,
        c: [
          {
            cc: 24,
            cn: "បន្ទាយដែក",
            d: null,
          },
          {
            cc: 25,
            cn: "ឈើទាល",
            d: null,
          },
          {
            cc: 26,
            cn: "ដីឥដ្ឋ",
            d: null,
          },
          {
            cc: 27,
            cn: "កំពង់ស្វាយ",
            d: null,
          },
          {
            cc: 29,
            cn: "គគីរ",
            d: null,
          },
          {
            cc: 30,
            cn: "គគីរធំ",
            d: null,
          },
          {
            cc: 31,
            cn: "ភូមិធំ",
            d: null,
          },
          {
            cc: 34,
            cn: "សំរោងធំ",
            d: null,
          },
        ],
      },
      {
        bn: "ខ្សាច់កណ្តាល",
        bc: 3,
        c: [
          {
            cc: 37,
            cn: "ជ័យធំ",
            d: null,
          },
          {
            cc: 38,
            cn: "កំពង់ចំលង",
            d: null,
          },
          {
            cc: 39,
            cn: "កោះចូរ៉ាម",
            d: null,
          },
          {
            cc: 41,
            cn: "ព្រះប្រសប់",
            d: null,
          },
          {
            cc: 45,
            cn: "ព្រែកតាមាក់",
            d: null,
          },
          {
            cc: 46,
            cn: "ពុកឫស្សី",
            d: null,
          },
          {
            cc: 47,
            cn: "រកាជន្លឹង",
            d: null,
          },
          {
            cc: 48,
            cn: "សន្លុង",
            d: null,
          },
          {
            cc: 49,
            cn: "ស៊ីធរ",
            d: null,
          },
          {
            cc: 51,
            cn: "ស្វាយរមៀត",
            d: null,
          },
          {
            cc: 52,
            cn: "តាឯក",
            d: null,
          },
          {
            cc: 53,
            cn: "វិហារសួគ៌",
            d: null,
          },
        ],
      },
      {
        bn: "កោះធំ",
        bc: 4,
        c: [
          {
            cc: 56,
            cn: "កំពង់កុង",
            d: null,
          },
          {
            cc: 57,
            cn: "កោះធំ ក",
            d: null,
          },
          {
            cc: 58,
            cn: "កោះធំ ខ",
            d: null,
          },
          {
            cc: 59,
            cn: "លើកដែក",
            d: null,
          },
          {
            cc: 60,
            cn: "ពោធិ៍បាន",
            d: null,
          },
          {
            cc: 63,
            cn: "ព្រែកថ្មី",
            d: null,
          },
        ],
      },
      {
        bn: "លើកដែក",
        bc: 5,
        c: [
          {
            cc: 65,
            cn: "កំពង់ភ្នំ",
            d: null,
          },
          {
            cc: 66,
            cn: "ក្អមសំណរ",
            d: null,
          },
          {
            cc: 67,
            cn: "ខ្ពបអាទាវ",
            d: null,
          },
          {
            cc: 68,
            cn: "ពាមរាំង",
            d: null,
          },
          {
            cc: 69,
            cn: "ព្រែកដាច់",
            d: null,
          },
          {
            cc: 70,
            cn: "ព្រែកទន្លាប់",
            d: null,
          },
          {
            cc: 71,
            cn: "សណ្តារ",
            d: null,
          },
        ],
      },
      {
        bn: "ល្វាឯម",
        bc: 6,
        c: [
          {
            cc: 74,
            cn: "បឹងគ្រំ",
            d: null,
          },
          {
            cc: 75,
            cn: "កោះកែវ",
            d: null,
          },
          {
            cc: 76,
            cn: "កោះរះ",
            d: null,
          },
          {
            cc: 77,
            cn: "ល្វាសរ",
            d: null,
          },
          {
            cc: 79,
            cn: "ភូមិធំ",
            d: null,
          },
          {
            cc: 81,
            cn: "ព្រែករៃ",
            d: null,
          },
          {
            cc: 82,
            cn: "ព្រែកឫស្សី",
            d: null,
          },
          {
            cc: 83,
            cn: "សំបួរ",
            d: null,
          },
          {
            cc: 85,
            cn: "ថ្មគរ",
            d: null,
          },
          {
            cc: 86,
            cn: "ទឹកឃ្លាំង",
            d: null,
          },
        ],
      },
      {
        bn: "មុខកំពូល",
        bc: 7,
        c: [
          {
            cc: 89,
            cn: "ព្រែកអញ្ចាញ",
            d: null,
          },
          {
            cc: 90,
            cn: "ព្រែកដំបង",
            d: null,
          },
          {
            cc: 91,
            cn: "រកាកោងទី ១",
            d: null,
          },
          {
            cc: 92,
            cn: "រកាកោងទី ២",
            d: null,
          },
          {
            cc: 93,
            cn: "ឫស្សីជ្រោយ",
            d: null,
          },
          {
            cc: 94,
            cn: "សំបួរមាស",
            d: null,
          },
          {
            cc: 95,
            cn: "ស្វាយអំពារ",
            d: null,
          },
        ],
      },
      {
        bn: "អង្គស្នួល",
        bc: 8,
        c: [
          {
            cc: 96,
            cn: "បែកចាន",
            d: null,
          },
          {
            cc: 98,
            cn: "ឆក់ឈើនាង",
            d: null,
          },
          {
            cc: 99,
            cn: "ដំណាក់អំពិល",
            d: null,
          },
          {
            cc: 102,
            cn: "ក្រាំងម្កាក់",
            d: null,
          },
          {
            cc: 103,
            cn: "លំហាច",
            d: null,
          },
          {
            cc: 104,
            cn: "ម្កាក់",
            d: null,
          },
          {
            cc: 106,
            cn: "ពើក",
            d: null,
          },
          {
            cc: 108,
            cn: "ព្រៃពួច",
            d: null,
          },
          {
            cc: 109,
            cn: "សំរោងលើ",
            d: null,
          },
          {
            cc: 111,
            cn: "ទួលព្រេជ",
            d: null,
          },
        ],
      },
      {
        bn: "ពញាឮ",
        bc: 9,
        c: [
          {
            cc: 112,
            cn: "ឈ្វាំង",
            d: null,
          },
          {
            cc: 113,
            cn: "ជ្រៃលាស់",
            d: null,
          },
          {
            cc: 114,
            cn: "កំពង់ហ្លួង",
            d: null,
          },
          {
            cc: 115,
            cn: "កំពង់អុស",
            d: null,
          },
          {
            cc: 116,
            cn: "កោះចិន",
            d: null,
          },
          {
            cc: 117,
            cn: "ភ្នំបាត",
            d: null,
          },
          {
            cc: 118,
            cn: "ពញាឮ",
            d: null,
          },
          {
            cc: 121,
            cn: "ព្រែកតាទែន",
            d: null,
          },
          {
            cc: 122,
            cn: "ផ្សារដែក",
            d: null,
          },
          {
            cc: 124,
            cn: "ទំនប់ធំ",
            d: null,
          },
          {
            cc: 125,
            cn: "វិហារហ្លួង",
            d: null,
          },
        ],
      },
      {
        bn: "ស្អាង",
        bc: 10,
        c: [
          {
            cc: 126,
            cn: "ខ្ពប",
            d: null,
          },
          {
            cc: 128,
            cn: "កោះខែល",
            d: null,
          },
          {
            cc: 129,
            cn: "កោះខ្សាច់ទន្លា",
            d: null,
          },
          {
            cc: 130,
            cn: "ក្រាំងយ៉ូវ",
            d: null,
          },
          {
            cc: 131,
            cn: "ប្រាសាទ",
            d: null,
          },
          {
            cc: 132,
            cn: "ព្រែកអំបិល",
            d: null,
          },
          {
            cc: 133,
            cn: "ព្រែកគយ",
            d: null,
          },
          {
            cc: 135,
            cn: "ស្អាងភ្នំ",
            d: null,
          },
          {
            cc: 137,
            cn: "ស្វាយប្រទាល",
            d: null,
          },
          {
            cc: 139,
            cn: "តាលន់",
            d: null,
          },
          {
            cc: 140,
            cn: "ត្រើយស្លា",
            d: null,
          },
          {
            cc: 141,
            cn: "ទឹកវិល",
            d: null,
          },
        ],
      },
      {
        bn: "តាខ្មៅ",
        bc: 11,
        c: [
          {
            cc: 127,
            cn: "កោះអន្លង់ចិន",
            d: null,
          },
          {
            cc: 134,
            cn: "រកាខ្ពស់",
            d: null,
          },
          {
            cc: 136,
            cn: "សិត្បូ",
            d: null,
          },
          {
            cc: 138,
            cn: "ស្វាយរលំ",
            d: null,
          },
          {
            cc: 142,
            cn: "តាក្តុល",
            d: null,
          },
          {
            cc: 143,
            cn: "ព្រែកឫស្សី",
            d: null,
          },
          {
            cc: 144,
            cn: "ដើមមៀន",
            d: null,
          },
          {
            cc: 145,
            cn: "តាខ្មៅ",
            d: null,
          },
          {
            cc: 146,
            cn: "ព្រែកហូរ",
            d: null,
          },
          {
            cc: 147,
            cn: "កំពង់សំណាញ់",
            d: null,
          },
        ],
      },
      {
        bn: "សំពៅពូន",
        bc: 12,
        c: [
          {
            cc: 54,
            cn: "ឈើខ្មៅ",
            d: null,
          },
          {
            cc: 55,
            cn: "ជ្រោយតាកែវ",
            d: null,
          },
          {
            cc: 61,
            cn: "ព្រែកជ្រៃ",
            d: null,
          },
          {
            cc: 62,
            cn: "ព្រែកស្តី",
            d: null,
          },
          {
            cc: 64,
            cn: "សំពៅពូន",
            d: null,
          },
        ],
      },
      {
        bn: "អរិយក្សត្រ",
        bc: 13,
        c: [
          {
            cc: 36,
            cn: "បាក់ដាវ",
            d: null,
          },
          {
            cc: 40,
            cn: "កោះឧកញ៉ាតី",
            d: null,
          },
          {
            cc: 42,
            cn: "ព្រែកអំពិល",
            d: null,
          },
          {
            cc: 43,
            cn: "ព្រែកលួង",
            d: null,
          },
          {
            cc: 44,
            cn: "ព្រែកតាកូវ",
            d: null,
          },
          {
            cc: 50,
            cn: "ស្វាយជ្រំ",
            d: null,
          },
          {
            cc: 72,
            cn: "អរិយក្សត្រ",
            d: null,
          },
          {
            cc: 73,
            cn: "បារុង",
            d: null,
          },
          {
            cc: 78,
            cn: "ពាមឧកញ៉ាអុង",
            d: null,
          },
          {
            cc: 80,
            cn: "ព្រែកក្មេង",
            d: null,
          },
          {
            cc: 84,
            cn: "សារិកាកែវ",
            d: null,
          },
        ],
      },
    ],
  },
  {
    name: "កោះកុង",
    ls: [
      {
        bn: "បូទុមសាគរ",
        bc: 1,
        c: [
          {
            cc: 1,
            cn: "អណ្តូងទឹក",
            d: null,
          },
          {
            cc: 2,
            cn: "កណ្តោល",
            d: null,
          },
          {
            cc: 3,
            cn: "តានូន",
            d: null,
          },
          {
            cc: 4,
            cn: "ថ្ម ស",
            d: null,
          },
        ],
      },
      {
        bn: "គិរីសាគរ",
        bc: 2,
        c: [
          {
            cc: 5,
            cn: "កោះស្តេច",
            d: null,
          },
          {
            cc: 6,
            cn: "ភ្ញីមាស",
            d: null,
          },
          {
            cc: 7,
            cn: "ព្រែកខ្សាច់",
            d: null,
          },
        ],
      },
      {
        bn: "កោះកុង",
        bc: 3,
        c: [
          {
            cc: 8,
            cn: "ជ្រោយប្រស់",
            d: null,
          },
          {
            cc: 9,
            cn: "កោះកាពិ",
            d: null,
          },
          {
            cc: 10,
            cn: "តាតៃក្រោម",
            d: null,
          },
          {
            cc: 11,
            cn: "ត្រពាំងរូង",
            d: null,
          },
        ],
      },
      {
        bn: "ខេមរភូមិន្ទ",
        bc: 4,
        c: [
          {
            cc: 12,
            cn: "ស្មាច់មានជ័យ",
            d: null,
          },
          {
            cc: 13,
            cn: "ដងទង់",
            d: null,
          },
          {
            cc: 14,
            cn: "ស្ទឹងវែង",
            d: null,
          },
        ],
      },
      {
        bn: "មណ្ឌលសីមា",
        bc: 5,
        c: [
          {
            cc: 15,
            cn: "ប៉ាក់ខ្លង",
            d: null,
          },
          {
            cc: 16,
            cn: "ពាមក្រសោប",
            d: null,
          },
          {
            cc: 17,
            cn: "ទួលគគីរ",
            d: null,
          },
        ],
      },
      {
        bn: "ស្រែអំបិល",
        bc: 6,
        c: [
          {
            cc: 18,
            cn: "បឹងព្រាវ",
            d: null,
          },
          {
            cc: 19,
            cn: "ជីខក្រោម",
            d: null,
          },
          {
            cc: 20,
            cn: "ជីខលើ",
            d: null,
          },
          {
            cc: 21,
            cn: "ជ្រោយស្វាយ",
            d: null,
          },
          {
            cc: 22,
            cn: "ដងពែង",
            d: null,
          },
          {
            cc: 23,
            cn: "ស្រែអំបិល",
            d: null,
          },
        ],
      },
      {
        bn: "ថ្មបាំង",
        bc: 7,
        c: [
          {
            cc: 25,
            cn: "ជីផាត",
            d: null,
          },
          {
            cc: 26,
            cn: "ប្រឡាយ",
            d: null,
          },
          {
            cc: 27,
            cn: "ជំនាប់",
            d: null,
          },
          {
            cc: 28,
            cn: "ថ្មដូនពៅ",
            d: null,
          },
          {
            cc: 29,
            cn: "ឫស្សីជ្រុំ",
            d: null,
          },
          {
            cc: 30,
            cn: "តាទៃលើ",
            d: null,
          },
        ],
      },
    ],
  },
  {
    name: "ក្រចេះ",
    ls: [
      {
        bn: "ឆ្លូង",
        bc: 1,
        c: [
          {
            cc: 1,
            cn: "ឆ្លូង",
            d: null,
          },
          {
            cc: 2,
            cn: "ដំរីផុង",
            d: null,
          },
          {
            cc: 3,
            cn: "ហាន់ជ័យ",
            d: null,
          },
          {
            cc: 4,
            cn: "កំពង់ដំរី",
            d: null,
          },
          {
            cc: 5,
            cn: "កញ្ជរ",
            d: null,
          },
          {
            cc: 6,
            cn: "ខ្សាច់អណ្តែត",
            d: null,
          },
          {
            cc: 7,
            cn: "ពង្រ",
            d: null,
          },
          {
            cc: 8,
            cn: "ព្រែកសាម៉ាន់",
            d: null,
          },
        ],
      },
      {
        bn: "ចិត្របុរី",
        bc: 2,
        c: [
          {
            cc: 9,
            cn: "បុសលាវ",
            d: null,
          },
          {
            cc: 10,
            cn: "ចង្ក្រង់",
            d: null,
          },
          {
            cc: 11,
            cn: "ដារ",
            d: null,
          },
          {
            cc: 12,
            cn: "កន្ទួត",
            d: null,
          },
          {
            cc: 13,
            cn: "គោលាប់",
            d: null,
          },
          {
            cc: 14,
            cn: "កោះច្រែង",
            d: null,
          },
          {
            cc: 20,
            cn: "សំបុក",
            d: null,
          },
          {
            cc: 21,
            cn: "ថ្មអណ្តើក",
            d: null,
          },
          {
            cc: 22,
            cn: "ថ្មគ្រែ",
            d: null,
          },
          {
            cc: 23,
            cn: "ថ្មី",
            d: null,
          },
        ],
      },
      {
        bn: "ក្រចេះ",
        bc: 3,
        c: [
          {
            cc: 15,
            cn: "កោះទ្រង់",
            d: null,
          },
          {
            cc: 16,
            cn: "ក្រគរ",
            d: null,
          },
          {
            cc: 17,
            cn: "ក្រចេះ",
            d: null,
          },
          {
            cc: 18,
            cn: "អូរឫស្សី",
            d: null,
          },
          {
            cc: 19,
            cn: "រកាកណ្តាល",
            d: null,
          },
        ],
      },
      {
        bn: "ព្រែកប្រសព្វ",
        bc: 4,
        c: [
          {
            cc: 24,
            cn: "ចំបក់",
            d: null,
          },
          {
            cc: 25,
            cn: "ជ្រោយបន្ទាយ",
            d: null,
          },
          {
            cc: 26,
            cn: "កំពង់គរ",
            d: null,
          },
          {
            cc: 27,
            cn: "កោះតាស៊ុយ",
            d: null,
          },
          {
            cc: 28,
            cn: "ព្រែកប្រសព្វ",
            d: null,
          },
          {
            cc: 29,
            cn: "ឫស្សីកែវ",
            d: null,
          },
          {
            cc: 30,
            cn: "សោប",
            d: null,
          },
          {
            cc: 31,
            cn: "តាម៉ៅ",
            d: null,
          },
        ],
      },
      {
        bn: "សំបូរ",
        bc: 5,
        c: [
          {
            cc: 32,
            cn: "បឹងចារ",
            d: null,
          },
          {
            cc: 33,
            cn: "កំពង់ចាម",
            d: null,
          },
          {
            cc: 35,
            cn: "កោះខ្ញែរ",
            d: null,
          },
          {
            cc: 38,
            cn: "សំបូរ",
            d: null,
          },
          {
            cc: 39,
            cn: "សណ្តាន់",
            d: null,
          },
          {
            cc: 41,
            cn: "វឌ្ឍនៈ",
            d: null,
          },
        ],
      },
      {
        bn: "ស្នួល",
        bc: 6,
        c: [
          {
            cc: 42,
            cn: "ឃ្សឹម",
            d: null,
          },
          {
            cc: 43,
            cn: "២ ធ្នូ",
            d: null,
          },
          {
            cc: 44,
            cn: "ស្នួល",
            d: null,
          },
          {
            cc: 45,
            cn: "ស្រែចារ",
            d: null,
          },
          {
            cc: 46,
            cn: "ស្វាយជ្រះ",
            d: null,
          },
          {
            cc: 47,
            cn: "គ្រញូងសែនជ័យ",
            d: null,
          },
        ],
      },
      {
        bn: "អូរគ្រៀងសែនជ័យ",
        bc: 7,
        c: [
          {
            cc: 34,
            cn: "ក្បាលដំរី",
            d: null,
          },
          {
            cc: 36,
            cn: "អូរគ្រៀង",
            d: null,
          },
          {
            cc: 37,
            cn: "រលួសមានជ័យ",
            d: null,
          },
          {
            cc: 40,
            cn: "ស្រែជិះ",
            d: null,
          },
          {
            cc: 48,
            cn: "អូរកណ្ដៀរសែនជ័យ",
            d: null,
          },
        ],
      },
    ],
  },
  {
    name: "មណ្ឌលគិរី",
    ls: [
      {
        bn: "កែវសីមា",
        bc: 1,
        c: [
          {
            cc: 1,
            cn: "ចុងផ្លាស់",
            d: null,
          },
          {
            cc: 2,
            cn: "មេម៉ង់",
            d: null,
          },
          {
            cc: 3,
            cn: "ស្រែឈូក",
            d: null,
          },
          {
            cc: 4,
            cn: "ស្រែខ្ទុម",
            d: null,
          },
          {
            cc: 5,
            cn: "ស្រែព្រះ",
            d: null,
          },
        ],
      },
      {
        bn: "កោះញែក",
        bc: 2,
        c: [
          {
            cc: 6,
            cn: "ណងឃីលិក",
            d: null,
          },
          {
            cc: 7,
            cn: "អ បួនលើ",
            d: null,
          },
          {
            cc: 8,
            cn: "រយ៉",
            d: null,
          },
          {
            cc: 9,
            cn: "សុខសាន្ត",
            d: null,
          },
          {
            cc: 10,
            cn: "ស្រែហ៊ុយ",
            d: null,
          },
          {
            cc: 11,
            cn: "ស្រែសង្គម",
            d: null,
          },
        ],
      },
      {
        bn: "អូររាំង",
        bc: 3,
        c: [
          {
            cc: 12,
            cn: "ដាក់ដាំ",
            d: null,
          },
          {
            cc: 13,
            cn: "សែនមនោរម្យ",
            d: null,
          },
        ],
      },
      {
        bn: "ពេជ្រាដា",
        bc: 4,
        c: [
          {
            cc: 14,
            cn: "ក្រង់តេះ",
            d: null,
          },
          {
            cc: 15,
            cn: "ពូជ្រៃ",
            d: null,
          },
          {
            cc: 16,
            cn: "ស្រែអំពូម",
            d: null,
          },
          {
            cc: 17,
            cn: "ប៊ូស្រា",
            d: null,
          },
        ],
      },
      {
        bn: "សែនមនោរម្យ",
        bc: 5,
        c: [
          {
            cc: 18,
            cn: "មនោរម្យ",
            d: null,
          },
          {
            cc: 19,
            cn: "សុខដុម",
            d: null,
          },
          {
            cc: 20,
            cn: "ស្ពានមានជ័យ",
            d: null,
          },
          {
            cc: 21,
            cn: "រមនា",
            d: null,
          },
        ],
      },
    ],
  },
  {
    name: "ភ្នំពេញ",
    ls: [
      {
        bn: "ចំការមន",
        bc: 1,
        c: [
          {
            cc: 1,
            cn: "ទន្លេបាសាក់",
            d: null,
          },
          {
            cc: 9,
            cn: "ទួលទំពូងទី ១",
            d: null,
          },
          {
            cc: 10,
            cn: "ទួលទំពូងទី ២",
            d: null,
          },
          {
            cc: 11,
            cn: "បឹងត្របែក",
            d: null,
          },
          {
            cc: 12,
            cn: "ផ្សារដើមថ្កូវ",
            d: null,
          },
        ],
      },
      {
        bn: "ដូនពេញ",
        bc: 2,
        c: [
          {
            cc: 13,
            cn: "ផ្សារថ្មីទី ១",
            d: null,
          },
          {
            cc: 14,
            cn: "ផ្សារថ្មីទី ២",
            d: null,
          },
          {
            cc: 15,
            cn: "ផ្សារថ្មីទី ៣",
            d: null,
          },
          {
            cc: 16,
            cn: "បឹងរាំង",
            d: null,
          },
          {
            cc: 17,
            cn: "ផ្សារកណ្តាលទី ១",
            d: null,
          },
          {
            cc: 18,
            cn: "ផ្សារកណ្តាលទី ២",
            d: null,
          },
          {
            cc: 19,
            cn: "ចតុមុខ",
            d: null,
          },
          {
            cc: 20,
            cn: "ជ័យជំនះ",
            d: null,
          },
          {
            cc: 21,
            cn: "ផ្សារចាស់",
            d: null,
          },
          {
            cc: 22,
            cn: "ស្រះចក",
            d: null,
          },
          {
            cc: 23,
            cn: "វត្តភ្នំ",
            d: null,
          },
        ],
      },
      {
        bn: "៧មករា",
        bc: 3,
        c: [
          {
            cc: 24,
            cn: "អូរឫស្សីទី ១",
            d: null,
          },
          {
            cc: 25,
            cn: "អូរឫស្សីទី ២",
            d: null,
          },
          {
            cc: 26,
            cn: "អូរឫស្សីទី ៣",
            d: null,
          },
          {
            cc: 27,
            cn: "អូរឫសី្សទី ៤",
            d: null,
          },
          {
            cc: 28,
            cn: "មនោរម្យ",
            d: null,
          },
          {
            cc: 29,
            cn: "មិត្តភាព",
            d: null,
          },
          {
            cc: 30,
            cn: "វាលវង់",
            d: null,
          },
          {
            cc: 31,
            cn: "បឹងព្រលឹត",
            d: null,
          },
        ],
      },
      {
        bn: "ទួលគោក",
        bc: 4,
        c: [
          {
            cc: 32,
            cn: "ផ្សារដេប៉ូទី ១",
            d: null,
          },
          {
            cc: 33,
            cn: "ផ្សារដេប៉ូទី ២",
            d: null,
          },
          {
            cc: 34,
            cn: "ផ្សារដេប៉ូទី ៣",
            d: null,
          },
          {
            cc: 35,
            cn: "ទឹកល្អក់ទី ១",
            d: null,
          },
          {
            cc: 36,
            cn: "ទឹកល្អក់ទី ២",
            d: null,
          },
          {
            cc: 37,
            cn: "ទឹកល្អក់ទី ៣",
            d: null,
          },
          {
            cc: 38,
            cn: "បឹងកក់ទី ១",
            d: null,
          },
          {
            cc: 39,
            cn: "បឹងកក់ទី ២",
            d: null,
          },
          {
            cc: 40,
            cn: "ផ្សារដើមគរ",
            d: null,
          },
          {
            cc: 41,
            cn: "បឹងសាឡាង",
            d: null,
          },
        ],
      },
      {
        bn: "ដង្កោ",
        bc: 5,
        c: [
          {
            cc: 42,
            cn: "ដង្កោ",
            d: null,
          },
          {
            cc: 48,
            cn: "ពងទឹក",
            d: null,
          },
          {
            cc: 49,
            cn: "ព្រៃវែង",
            d: null,
          },
          {
            cc: 51,
            cn: "ព្រៃ ស",
            d: null,
          },
          {
            cc: 53,
            cn: "ក្រាំងពង្រ",
            d: null,
          },
          {
            cc: 55,
            cn: "សាក់សំពៅ",
            d: null,
          },
          {
            cc: 56,
            cn: "ជើងឯក",
            d: null,
          },
          {
            cc: 77,
            cn: "គងនយ",
            d: null,
          },
          {
            cc: 78,
            cn: "ព្រែកកំពឹស",
            d: null,
          },
          {
            cc: 79,
            cn: "រលួស",
            d: null,
          },
          {
            cc: 80,
            cn: "ស្ពានថ្ម",
            d: null,
          },
          {
            cc: 81,
            cn: "ទៀន",
            d: null,
          },
        ],
      },
      {
        bn: "មានជ័យ",
        bc: 6,
        c: [
          {
            cc: 57,
            cn: "ស្ទឹងមានជ័យទី១",
            d: null,
          },
          {
            cc: 58,
            cn: "បឹងទំពន់ទី១",
            d: null,
          },
          {
            cc: 62,
            cn: "ចាក់អង្រែលើ",
            d: null,
          },
          {
            cc: 63,
            cn: "ចាក់អង្រែក្រោម",
            d: null,
          },
          {
            cc: 99,
            cn: "ស្ទឹងមានជ័យទី២",
            d: null,
          },
          {
            cc: 100,
            cn: "ស្ទឹងមានជ័យទី៣",
            d: null,
          },
          {
            cc: 101,
            cn: "បឹងទំពន់ទី២",
            d: null,
          },
        ],
      },
      {
        bn: "ឫស្សីកែវ",
        bc: 7,
        c: [
          {
            cc: 66,
            cn: "ទួលសង្កែទី១",
            d: null,
          },
          {
            cc: 67,
            cn: "ស្វាយប៉ាក",
            d: null,
          },
          {
            cc: 68,
            cn: "គីឡូម៉ែត្រលេខ ៦",
            d: null,
          },
          {
            cc: 70,
            cn: "ឫស្សីកែវ",
            d: null,
          },
          {
            cc: 75,
            cn: "ច្រាំងចំរេះទី ១",
            d: null,
          },
          {
            cc: 76,
            cn: "ច្រាំងចំរេះទី ២",
            d: null,
          },
          {
            cc: 103,
            cn: "ទួលសង្កែទី២",
            d: null,
          },
        ],
      },
      {
        bn: "សែនសុខ",
        bc: 8,
        c: [
          {
            cc: 52,
            cn: "ក្រាំងធ្នង់",
            d: null,
          },
          {
            cc: 65,
            cn: "ឃ្មួញ",
            d: null,
          },
          {
            cc: 69,
            cn: "ភ្នំពេញថ្មី",
            d: null,
          },
          {
            cc: 71,
            cn: "ទឹកថ្លា",
            d: null,
          },
          {
            cc: 104,
            cn: "គោកឃ្លាង",
            d: null,
          },
          {
            cc: 105,
            cn: "អូរបែកក្អម",
            d: null,
          },
        ],
      },
      {
        bn: "ពោធិ៍សែនជ័យ",
        bc: 9,
        c: [
          {
            cc: 43,
            cn: "ត្រពាំងក្រសាំង",
            d: null,
          },
          {
            cc: 46,
            cn: "ចោមចៅទី១",
            d: null,
          },
          {
            cc: 47,
            cn: "កាកាបទី១",
            d: null,
          },
          {
            cc: 50,
            cn: "សំរោងក្រោម",
            d: null,
          },
          {
            cc: 97,
            cn: "ចោមចៅទី២",
            d: null,
          },
          {
            cc: 98,
            cn: "ចោមចៅទី៣",
            d: null,
          },
          {
            cc: 102,
            cn: "កាកាបទី២",
            d: null,
          },
        ],
      },
      {
        bn: "ច្បារអំពៅ",
        bc: 10,
        c: [
          {
            cc: 59,
            cn: "ព្រែកប្រា",
            d: null,
          },
          {
            cc: 60,
            cn: "ច្បារអំពៅទី ១",
            d: null,
          },
          {
            cc: 61,
            cn: "ច្បារអំពៅទី ២",
            d: null,
          },
          {
            cc: 64,
            cn: "និរោធ",
            d: null,
          },
          {
            cc: 88,
            cn: "ក្បាលកោះ",
            d: null,
          },
          {
            cc: 89,
            cn: "ព្រែកឯង",
            d: null,
          },
          {
            cc: 90,
            cn: "ព្រែកថ្មី",
            d: null,
          },
          {
            cc: 91,
            cn: "វាលស្បូវ",
            d: null,
          },
        ],
      },
      {
        bn: "ជ្រោយចង្វារ",
        bc: 11,
        c: [
          {
            cc: 72,
            cn: "ព្រែកលៀប",
            d: null,
          },
          {
            cc: 73,
            cn: "ព្រែកតាសេក",
            d: null,
          },
          {
            cc: 74,
            cn: "ជ្រោយចង្វារ",
            d: null,
          },
          {
            cc: 92,
            cn: "បាក់ខែង",
            d: null,
          },
          {
            cc: 93,
            cn: "កោះដាច់",
            d: null,
          },
        ],
      },
      {
        bn: "ព្រែកព្នៅ",
        bc: 12,
        c: [
          {
            cc: 44,
            cn: "គោករកា",
            d: null,
          },
          {
            cc: 86,
            cn: "ពន្សាំង",
            d: null,
          },
          {
            cc: 94,
            cn: "ពញាពន់",
            d: null,
          },
          {
            cc: 95,
            cn: "ព្រែកព្នៅ",
            d: null,
          },
          {
            cc: 96,
            cn: "សំរោង",
            d: null,
          },
        ],
      },
      {
        bn: "បឹងកេងកង",
        bc: 13,
        c: [
          {
            cc: 2,
            cn: "បឹងកេងកងទី ១",
            d: null,
          },
          {
            cc: 3,
            cn: "បឹងកេងកងទី ២",
            d: null,
          },
          {
            cc: 4,
            cn: "បឹងកេងកងទី ៣",
            d: null,
          },
          {
            cc: 5,
            cn: "អូឡាំពិក",
            d: null,
          },
          {
            cc: 6,
            cn: "ទួលស្វាយព្រៃទី ១",
            d: null,
          },
          {
            cc: 7,
            cn: "ទួលស្វាយព្រៃទី ២",
            d: null,
          },
          {
            cc: 8,
            cn: "ទំនប់ទឹក",
            d: null,
          },
        ],
      },
      {
        bn: "កំបូល",
        bc: 14,
        c: [
          {
            cc: 45,
            cn: "ភ្លើងឆេះរទេះ",
            d: null,
          },
          {
            cc: 54,
            cn: "ប្រទះឡាង",
            d: null,
          },
          {
            cc: 82,
            cn: "បឹងធំ",
            d: null,
          },
          {
            cc: 83,
            cn: "កំបូល",
            d: null,
          },
          {
            cc: 84,
            cn: "កន្ទោក",
            d: null,
          },
          {
            cc: 85,
            cn: "ឪឡោក",
            d: null,
          },
          {
            cc: 87,
            cn: "ស្នោរ",
            d: null,
          },
        ],
      },
    ],
  },
  {
    name: "ព្រះវិហារ",
    ls: [
      {
        bn: "ជ័យសែន",
        bc: 1,
        c: [
          {
            cc: 1,
            cn: "ស្អាង",
            d: null,
          },
          {
            cc: 2,
            cn: "តស៊ូ",
            d: null,
          },
          {
            cc: 3,
            cn: "ខ្យង",
            d: null,
          },
          {
            cc: 4,
            cn: "ច្រាច់",
            d: null,
          },
          {
            cc: 5,
            cn: "ធ្មា",
            d: null,
          },
          {
            cc: 6,
            cn: "ពុទ្រា",
            d: null,
          },
        ],
      },
      {
        bn: "ឆែប",
        bc: 2,
        c: [
          {
            cc: 7,
            cn: "ឆែបមួយ ",
            d: null,
          },
          {
            cc: 8,
            cn: "ឆែបពីរ ",
            d: null,
          },
          {
            cc: 9,
            cn: "សង្កែមួយ",
            d: null,
          },
          {
            cc: 10,
            cn: "សង្កែពីរ",
            d: null,
          },
          {
            cc: 11,
            cn: "ម្លូព្រៃមួយ",
            d: null,
          },
          {
            cc: 12,
            cn: "ម្លូព្រៃពីរ",
            d: null,
          },
          {
            cc: 13,
            cn: "កំពង់ស្រឡៅមួយ ",
            d: null,
          },
          {
            cc: 14,
            cn: "កំពង់ស្រឡៅពីរ",
            d: null,
          },
        ],
      },
      {
        bn: "ជាំក្សាន្ត",
        bc: 3,
        c: [
          {
            cc: 15,
            cn: "ជាំក្សាន្ត",
            d: null,
          },
          {
            cc: 16,
            cn: "ទឹកក្រហម",
            d: null,
          },
          {
            cc: 17,
            cn: "ព្រីងធំ",
            d: null,
          },
          {
            cc: 18,
            cn: "រំដោះស្រែ",
            d: null,
          },
          {
            cc: 19,
            cn: "យាង",
            d: null,
          },
          {
            cc: 20,
            cn: "កន្ទួត",
            d: null,
          },
          {
            cc: 50,
            cn: "ស្រអែម",
            d: null,
          },
          {
            cc: 51,
            cn: "មរកត",
            d: null,
          },
        ],
      },
      {
        bn: "គូលែន",
        bc: 4,
        c: [
          {
            cc: 21,
            cn: "គូលែនត្បូង",
            d: null,
          },
          {
            cc: 22,
            cn: "គូលែនជើង",
            d: null,
          },
          {
            cc: 23,
            cn: "ថ្មី",
            d: null,
          },
          {
            cc: 24,
            cn: "ភ្នំពេញ",
            d: null,
          },
          {
            cc: 25,
            cn: "ភ្នំត្បែងពីរ",
            d: null,
          },
          {
            cc: 26,
            cn: "ស្រយង់",
            d: null,
          },
        ],
      },
      {
        bn: "រវៀង",
        bc: 5,
        c: [
          {
            cc: 27,
            cn: "របៀប",
            d: null,
          },
          {
            cc: 28,
            cn: "រស្មី",
            d: null,
          },
          {
            cc: 29,
            cn: "រហ័ស",
            d: null,
          },
          {
            cc: 30,
            cn: "រុងរឿង",
            d: null,
          },
          {
            cc: 31,
            cn: "រីករាយ",
            d: null,
          },
          {
            cc: 32,
            cn: "រួសរាន់",
            d: null,
          },
          {
            cc: 33,
            cn: "រតនៈ",
            d: null,
          },
          {
            cc: 34,
            cn: "រៀបរយ",
            d: null,
          },
          {
            cc: 35,
            cn: "រក្សា",
            d: null,
          },
          {
            cc: 36,
            cn: "រំដោះ",
            d: null,
          },
          {
            cc: 37,
            cn: "រមទម",
            d: null,
          },
          {
            cc: 38,
            cn: "រមណីយ",
            d: null,
          },
        ],
      },
      {
        bn: "សង្គមថ្មី",
        bc: 6,
        c: [
          {
            cc: 39,
            cn: "រអាង",
            d: null,
          },
          {
            cc: 40,
            cn: "ភ្នំត្បែងមួយ",
            d: null,
          },
          {
            cc: 41,
            cn: "ស្តៅ",
            d: null,
          },
          {
            cc: 42,
            cn: "រណសិរ្ស",
            d: null,
          },
          {
            cc: 43,
            cn: "ចំរើន",
            d: null,
          },
        ],
      },
      {
        bn: "ព្រះវិហារ",
        bc: 7,
        c: [
          {
            cc: 44,
            cn: "កំពង់ប្រណាក",
            d: null,
          },
          {
            cc: 45,
            cn: "ប៉ាលហាល",
            d: null,
          },
        ],
      },
      {
        bn: "ត្បែងមានជ័យ",
        bc: 8,
        c: [
          {
            cc: 46,
            cn: "ឈានមុខ",
            d: null,
          },
          {
            cc: 47,
            cn: "ពោធិ៍",
            d: null,
          },
          {
            cc: 48,
            cn: "ប្រមេរុ",
            d: null,
          },
          {
            cc: 49,
            cn: "ព្រះឃ្លាំង",
            d: null,
          },
        ],
      },
    ],
  },
  {
    name: "ព្រៃវែង",
    ls: [
      {
        bn: "បាភ្នំ",
        bc: 1,
        c: [
          {
            cc: 1,
            cn: "បឹងព្រះ",
            d: null,
          },
          {
            cc: 2,
            cn: "ជើងភ្នំ",
            d: null,
          },
          {
            cc: 3,
            cn: "ឈើកាច់",
            d: null,
          },
          {
            cc: 4,
            cn: "រក្សជ័យ",
            d: null,
          },
          {
            cc: 5,
            cn: "រោងដំរី",
            d: null,
          },
          {
            cc: 6,
            cn: "ស្តៅកោង",
            d: null,
          },
          {
            cc: 7,
            cn: "ស្ពឺ ក",
            d: null,
          },
          {
            cc: 8,
            cn: "ស្ពឺ ខ",
            d: null,
          },
          {
            cc: 9,
            cn: "ធាយ",
            d: null,
          },
        ],
      },
      {
        bn: "កំចាយមារ",
        bc: 2,
        c: [
          {
            cc: 10,
            cn: "ជាច",
            d: null,
          },
          {
            cc: 11,
            cn: "ដូនកឹង",
            d: null,
          },
          {
            cc: 12,
            cn: "ក្រញូង",
            d: null,
          },
          {
            cc: 13,
            cn: "ក្របៅ",
            d: null,
          },
          {
            cc: 14,
            cn: "ស៊ាងឃ្វាង",
            d: null,
          },
          {
            cc: 15,
            cn: "ស្មោងខាងជើង",
            d: null,
          },
          {
            cc: 16,
            cn: "ស្មោងខាងត្បូង",
            d: null,
          },
          {
            cc: 17,
            cn: "ត្របែក",
            d: null,
          },
        ],
      },
      {
        bn: "កំពង់ត្របែក",
        bc: 3,
        c: [
          {
            cc: 18,
            cn: "អន្សោង",
            d: null,
          },
          {
            cc: 19,
            cn: "ចាម",
            d: null,
          },
          {
            cc: 20,
            cn: "ជាងដែក",
            d: null,
          },
          {
            cc: 21,
            cn: "ជ្រៃ",
            d: null,
          },
          {
            cc: 22,
            cn: "កន្សោមអក",
            d: null,
          },
          {
            cc: 23,
            cn: "គោខ្ចក",
            d: null,
          },
          {
            cc: 24,
            cn: "កំពង់ត្របែក",
            d: null,
          },
          {
            cc: 25,
            cn: "ពាមមន្ទារ",
            d: null,
          },
          {
            cc: 26,
            cn: "ប្រាសាទ",
            d: null,
          },
          {
            cc: 27,
            cn: "ប្រធាតុ",
            d: null,
          },
          {
            cc: 28,
            cn: "ព្រៃឈរ",
            d: null,
          },
          {
            cc: 29,
            cn: "ព្រៃពោន",
            d: null,
          },
          {
            cc: 30,
            cn: "ថ្កូវ",
            d: null,
          },
        ],
      },
      {
        bn: "កញ្ជ្រៀច",
        bc: 4,
        c: [
          {
            cc: 31,
            cn: "ចុងអំពិល",
            d: null,
          },
          {
            cc: 32,
            cn: "កញ្ជ្រៀច",
            d: null,
          },
          {
            cc: 33,
            cn: "ក្តឿងរាយ",
            d: null,
          },
          {
            cc: 34,
            cn: "គោគគង់កើត",
            d: null,
          },
          {
            cc: 35,
            cn: "គោគគង់លិច",
            d: null,
          },
          {
            cc: 36,
            cn: "ព្រាល",
            d: null,
          },
          {
            cc: 37,
            cn: "ថ្មពូន",
            d: null,
          },
          {
            cc: 38,
            cn: "ត្នោត",
            d: null,
          },
        ],
      },
      {
        bn: "មេសាង",
        bc: 5,
        c: [
          {
            cc: 39,
            cn: "អង្គរ សរ",
            d: null,
          },
          {
            cc: 40,
            cn: "ច្រេស",
            d: null,
          },
          {
            cc: 41,
            cn: "ជីផុច",
            d: null,
          },
          {
            cc: 42,
            cn: "ព្រៃឃ្នេស",
            d: null,
          },
          {
            cc: 43,
            cn: "ព្រៃរំដេង",
            d: null,
          },
          {
            cc: 44,
            cn: "ព្រៃទទឹង",
            d: null,
          },
          {
            cc: 45,
            cn: "ស្វាយជ្រុំ",
            d: null,
          },
          {
            cc: 46,
            cn: "ត្រពាំងស្រែ",
            d: null,
          },
        ],
      },
      {
        bn: "ពាមជរ",
        bc: 6,
        c: [
          {
            cc: 47,
            cn: "អង្គរអង្គ",
            d: null,
          },
          {
            cc: 48,
            cn: "កំពង់ប្រាសាទ",
            d: null,
          },
          {
            cc: 49,
            cn: "កោះចេក",
            d: null,
          },
          {
            cc: 50,
            cn: "កោះរកា",
            d: null,
          },
          {
            cc: 51,
            cn: "កោះសំពៅ",
            d: null,
          },
          {
            cc: 52,
            cn: "ក្រាំងតាយ៉ង",
            d: null,
          },
          {
            cc: 53,
            cn: "ព្រែកក្របៅ",
            d: null,
          },
          {
            cc: 54,
            cn: "ព្រែកសំបួរ",
            d: null,
          },
          {
            cc: 55,
            cn: "ឫស្សីស្រុក",
            d: null,
          },
          {
            cc: 56,
            cn: "ស្វាយភ្លោះ",
            d: null,
          },
        ],
      },
      {
        bn: "ពាមរក៍",
        bc: 7,
        c: [
          {
            cc: 57,
            cn: "បាបោង",
            d: null,
          },
          {
            cc: 58,
            cn: "បន្លិចប្រាសាទ",
            d: null,
          },
          {
            cc: 59,
            cn: "អ្នកលឿង",
            d: null,
          },
          {
            cc: 60,
            cn: "ពាមមានជ័យ",
            d: null,
          },
          {
            cc: 61,
            cn: "ពាមរក៍",
            d: null,
          },
          {
            cc: 62,
            cn: "ព្រែកខ្សាយ ក",
            d: null,
          },
          {
            cc: 63,
            cn: "ព្រែកខ្សាយ ខ",
            d: null,
          },
          {
            cc: 64,
            cn: "ព្រៃកណ្តៀង",
            d: null,
          },
        ],
      },
      {
        bn: "ពារាំង",
        bc: 8,
        c: [
          {
            cc: 65,
            cn: "កំពង់ពពិល",
            d: null,
          },
          {
            cc: 66,
            cn: "កញ្ចំ",
            d: null,
          },
          {
            cc: 67,
            cn: "កំពង់ប្រាំង",
            d: null,
          },
          {
            cc: 69,
            cn: "មេសរប្រចាន់",
            d: null,
          },
          {
            cc: 71,
            cn: "ព្រៃព្នៅ",
            d: null,
          },
          {
            cc: 72,
            cn: "ព្រៃស្នៀត",
            d: null,
          },
          {
            cc: 73,
            cn: "ព្រៃស្រឡិត",
            d: null,
          },
          {
            cc: 74,
            cn: "រាប",
            d: null,
          },
          {
            cc: 75,
            cn: "រកា",
            d: null,
          },
        ],
      },
      {
        bn: "ព្រះស្តេច",
        bc: 9,
        c: [
          {
            cc: 76,
            cn: "អង្គររាជ្យ",
            d: null,
          },
          {
            cc: 77,
            cn: "បន្ទាយចក្រី",
            d: null,
          },
          {
            cc: 78,
            cn: "បឹងដោល",
            d: null,
          },
          {
            cc: 79,
            cn: "ជៃកំពក",
            d: null,
          },
          {
            cc: 80,
            cn: "កំពង់សឹង",
            d: null,
          },
          {
            cc: 81,
            cn: "ក្រាំងស្វាយ",
            d: null,
          },
          {
            cc: 82,
            cn: "ល្វា",
            d: null,
          },
          {
            cc: 83,
            cn: "ព្រះស្តេច",
            d: null,
          },
          {
            cc: 84,
            cn: "រាធរ",
            d: null,
          },
          {
            cc: 85,
            cn: "រំចេក",
            d: null,
          },
          {
            cc: 86,
            cn: "សេនារាជឧត្តម",
            d: null,
          },
        ],
      },
      {
        bn: "ស្វាយអន្ទរ",
        bc: 10,
        c: [
          {
            cc: 87,
            cn: "អង្គរទ្រេត",
            d: null,
          },
          {
            cc: 88,
            cn: "ជាខ្លាង",
            d: null,
          },
          {
            cc: 89,
            cn: "ជ្រៃ",
            d: null,
          },
          {
            cc: 90,
            cn: "ដំរីពួន",
            d: null,
          },
          {
            cc: 91,
            cn: "មេបុណ្យ",
            d: null,
          },
          {
            cc: 92,
            cn: "ពានរោង",
            d: null,
          },
          {
            cc: 93,
            cn: "ពពឺស",
            d: null,
          },
          {
            cc: 94,
            cn: "ព្រៃខ្លា",
            d: null,
          },
          {
            cc: 95,
            cn: "សំរោង",
            d: null,
          },
          {
            cc: 96,
            cn: "ស្វាយអន្ទរ",
            d: null,
          },
          {
            cc: 97,
            cn: "ទឹកថ្លា",
            d: null,
          },
        ],
      },
      {
        bn: "ព្រៃវែង",
        bc: 11,
        c: [
          {
            cc: 98,
            cn: "បារាយណ៍",
            d: null,
          },
          {
            cc: 99,
            cn: "ជើងទឹក",
            d: null,
          },
          {
            cc: 100,
            cn: "កំពង់លាវ",
            d: null,
          },
          {
            cc: 105,
            cn: "តាកោ",
            d: null,
          },
        ],
      },
      {
        bn: "ពោធិ៍រៀង",
        bc: 12,
        c: [
          {
            cc: 68,
            cn: "កំពង់ឫស្សី",
            d: null,
          },
          {
            cc: 70,
            cn: "ព្រែកតាសរ",
            d: null,
          },
          {
            cc: 101,
            cn: "ពោធិ៍រៀង",
            d: null,
          },
          {
            cc: 102,
            cn: "ព្រែកអន្ទះ",
            d: null,
          },
          {
            cc: 103,
            cn: "ព្រែកជ្រៃ",
            d: null,
          },
          {
            cc: 104,
            cn: "ព្រៃកន្លោង",
            d: null,
          },
        ],
      },
      {
        bn: "ស៊ីធរកណ្តាល",
        bc: 13,
        c: [
          {
            cc: 106,
            cn: "អំពិលក្រៅ",
            d: null,
          },
          {
            cc: 107,
            cn: "ជ្រៃឃ្មុំ",
            d: null,
          },
          {
            cc: 108,
            cn: "ល្វេ",
            d: null,
          },
          {
            cc: 109,
            cn: "ព្នៅទី១",
            d: null,
          },
          {
            cc: 110,
            cn: "ព្នៅទី២",
            d: null,
          },
          {
            cc: 111,
            cn: "ពោធិ៍ទី",
            d: null,
          },
          {
            cc: 112,
            cn: "ព្រែកចង្ក្រាន",
            d: null,
          },
          {
            cc: 113,
            cn: "ព្រៃដើមថ្នឹង",
            d: null,
          },
          {
            cc: 114,
            cn: "ព្រៃទឹង",
            d: null,
          },
          {
            cc: 115,
            cn: "រំលេច",
            d: null,
          },
          {
            cc: 116,
            cn: "ឫស្សីសាញ់",
            d: null,
          },
        ],
      },
    ],
  },
  {
    name: "ពោធិ៍សាត់ ",
    ls: [
      {
        bn: "បាកាន",
        bc: 1,
        c: [
          {
            cc: 1,
            cn: "បឹងបត់កណ្តោល",
            d: null,
          },
          {
            cc: 2,
            cn: "បឹងខ្នារ",
            d: null,
          },
          {
            cc: 3,
            cn: "ខ្នារទទឹង",
            d: null,
          },
          {
            cc: 4,
            cn: "មេទឹក",
            d: null,
          },
          {
            cc: 5,
            cn: "អូរតាប៉ោង",
            d: null,
          },
          {
            cc: 6,
            cn: "រំលេច",
            d: null,
          },
          {
            cc: 7,
            cn: "ស្នាមព្រះ",
            d: null,
          },
          {
            cc: 8,
            cn: "ស្វាយដូនកែវ",
            d: null,
          },
          {
            cc: 10,
            cn: "ត្រពាំងជង",
            d: null,
          },
        ],
      },
      {
        bn: "កណ្តៀង",
        bc: 2,
        c: [
          {
            cc: 11,
            cn: "អន្លង់វិល",
            d: null,
          },
          {
            cc: 13,
            cn: "កណ្តៀង",
            d: null,
          },
          {
            cc: 14,
            cn: "កញ្ជរ",
            d: null,
          },
          {
            cc: 15,
            cn: "រាំងទិល",
            d: null,
          },
          {
            cc: 16,
            cn: "ស្រែស្តុក",
            d: null,
          },
          {
            cc: 17,
            cn: "ស្វាយលួង",
            d: null,
          },
          {
            cc: 18,
            cn: "ស្យា",
            d: null,
          },
          {
            cc: 19,
            cn: "វាល",
            d: null,
          },
          {
            cc: 39,
            cn: "កោះជុំ",
            d: null,
          },
        ],
      },
      {
        bn: "ក្រគរ",
        bc: 3,
        c: [
          {
            cc: 20,
            cn: "អន្លង់ត្នោត",
            d: null,
          },
          {
            cc: 21,
            cn: "អន្សាចំបក់",
            d: null,
          },
          {
            cc: 22,
            cn: "បឹងកន្ទួត",
            d: null,
          },
          {
            cc: 23,
            cn: "ឈើតុំ",
            d: null,
          },
          {
            cc: 24,
            cn: "កំពង់លួង",
            d: null,
          },
          {
            cc: 25,
            cn: "កំពង់ពោធិ៍",
            d: null,
          },
          {
            cc: 26,
            cn: "ក្បាលត្រាច",
            d: null,
          },
          {
            cc: 27,
            cn: "អូរសណ្តាន់",
            d: null,
          },
          {
            cc: 28,
            cn: "ស្នាអន្សា",
            d: null,
          },
          {
            cc: 29,
            cn: "ស្វាយ ស",
            d: null,
          },
          {
            cc: 30,
            cn: "ត្នោតជុំ",
            d: null,
          },
        ],
      },
      {
        bn: "ភ្នំក្រវាញ",
        bc: 4,
        c: [
          {
            cc: 31,
            cn: "បាក់ចិញ្ចៀន",
            d: null,
          },
          {
            cc: 32,
            cn: "លាច",
            d: null,
          },
          {
            cc: 34,
            cn: "ព្រងិល",
            d: null,
          },
          {
            cc: 35,
            cn: "រកាត",
            d: null,
          },
          {
            cc: 36,
            cn: "សន្ទ្រែ",
            d: null,
          },
          {
            cc: 37,
            cn: "សំរោង",
            d: null,
          },
        ],
      },
      {
        bn: "ពោធិ៍សាត់",
        bc: 5,
        c: [
          {
            cc: 12,
            cn: "បន្ទាយដី",
            d: null,
          },
          {
            cc: 38,
            cn: "ចំរើនផល",
            d: null,
          },
          {
            cc: 40,
            cn: "លលកស",
            d: null,
          },
          {
            cc: 41,
            cn: "ផ្ទះព្រៃ",
            d: null,
          },
          {
            cc: 42,
            cn: "ព្រៃញី",
            d: null,
          },
          {
            cc: 43,
            cn: "រលាប",
            d: null,
          },
          {
            cc: 44,
            cn: "ស្វាយអាត់",
            d: null,
          },
        ],
      },
      {
        bn: "វាលវែង",
        bc: 6,
        c: [
          {
            cc: 45,
            cn: "អន្លង់រាប",
            d: null,
          },
          {
            cc: 46,
            cn: "ក្រពើពីរ",
            d: null,
          },
          {
            cc: 47,
            cn: "អូរសោម",
            d: null,
          },
          {
            cc: 48,
            cn: "ប្រម៉ោយ",
            d: null,
          },
          {
            cc: 49,
            cn: "ថ្មដា",
            d: null,
          },
        ],
      },
      {
        bn: "តាលោសែនជ័យ",
        bc: 7,
        c: [
          {
            cc: 9,
            cn: "តាលោ",
            d: null,
          },
          {
            cc: 33,
            cn: "ផ្ទះរុង",
            d: null,
          },
        ],
      },
    ],
  },
  {
    name: "រតនគិរី",
    ls: [
      {
        bn: "អណ្តូងមាស",
        bc: 1,
        c: [
          {
            cc: 1,
            cn: "ម៉ាលិក",
            d: null,
          },
          {
            cc: 2,
            cn: "ញ៉ាង",
            d: null,
          },
          {
            cc: 3,
            cn: "តាឡាវ",
            d: null,
          },
        ],
      },
      {
        bn: "បានលុង",
        bc: 2,
        c: [
          {
            cc: 4,
            cn: "កាចាញ",
            d: null,
          },
          {
            cc: 5,
            cn: "ឡាបានសៀក",
            d: null,
          },
          {
            cc: 6,
            cn: "យក្ខឡោម",
            d: null,
          },
          {
            cc: 50,
            cn: "បឹងកន្សែង",
            d: null,
          },
        ],
      },
      {
        bn: "បរកែវ",
        bc: 3,
        c: [
          {
            cc: 7,
            cn: "កក់",
            d: null,
          },
          {
            cc: 8,
            cn: "កិះចុង",
            d: null,
          },
          {
            cc: 9,
            cn: "ឡាមិញ",
            d: null,
          },
          {
            cc: 10,
            cn: "លុងឃុង",
            d: null,
          },
          {
            cc: 11,
            cn: "ស៊ើង",
            d: null,
          },
          {
            cc: 12,
            cn: "ទីងចាក់",
            d: null,
          },
        ],
      },
      {
        bn: "កូនមុំ",
        bc: 4,
        c: [
          {
            cc: 13,
            cn: "សិរីមង្គល",
            d: null,
          },
          {
            cc: 14,
            cn: "ស្រែអង្រ្គង",
            d: null,
          },
          {
            cc: 15,
            cn: "តាអង",
            d: null,
          },
          {
            cc: 16,
            cn: "តឺន",
            d: null,
          },
          {
            cc: 17,
            cn: "ត្រពាំងច្រេស",
            d: null,
          },
          {
            cc: 18,
            cn: "ត្រពាំងក្រហម",
            d: null,
          },
        ],
      },
      {
        bn: "លំផាត់",
        bc: 5,
        c: [
          {
            cc: 19,
            cn: "ជ័យឧត្តម",
            d: null,
          },
          {
            cc: 20,
            cn: "កាឡែង",
            d: null,
          },
          {
            cc: 21,
            cn: "ល្បាំង ១",
            d: null,
          },
          {
            cc: 22,
            cn: "ល្បាំង ២",
            d: null,
          },
          {
            cc: 23,
            cn: "បាតាង",
            d: null,
          },
          {
            cc: 24,
            cn: "សេដា",
            d: null,
          },
        ],
      },
      {
        bn: "អូរជុំ",
        bc: 6,
        c: [
          {
            cc: 25,
            cn: "ចាអ៊ុង",
            d: null,
          },
          {
            cc: 26,
            cn: "ប៉ូយ",
            d: null,
          },
          {
            cc: 27,
            cn: "ឯកភាព",
            d: null,
          },
          {
            cc: 28,
            cn: "កាឡៃ",
            d: null,
          },
          {
            cc: 29,
            cn: "អូរជុំ",
            d: null,
          },
          {
            cc: 30,
            cn: "សាមគ្គី",
            d: null,
          },
          {
            cc: 31,
            cn: "ល្អក់",
            d: null,
          },
        ],
      },
      {
        bn: "អូរយ៉ាដាវ",
        bc: 7,
        c: [
          {
            cc: 32,
            cn: "បរខាំ",
            d: null,
          },
          {
            cc: 33,
            cn: "លំជ័រ",
            d: null,
          },
          {
            cc: 34,
            cn: "ប៉ក់ញ៉ៃ",
            d: null,
          },
          {
            cc: 35,
            cn: "ប៉ាតេ",
            d: null,
          },
          {
            cc: 36,
            cn: "សេសាន",
            d: null,
          },
          {
            cc: 37,
            cn: "សោមធំ",
            d: null,
          },
          {
            cc: 38,
            cn: "យ៉ាទុង",
            d: null,
          },
        ],
      },
      {
        bn: "តាវែង",
        bc: 8,
        c: [
          {
            cc: 39,
            cn: "តាវែងលើ",
            d: null,
          },
          {
            cc: 40,
            cn: "តាវែងក្រោម",
            d: null,
          },
        ],
      },
      {
        bn: "វើនសៃ",
        bc: 9,
        c: [
          {
            cc: 41,
            cn: "ប៉ុង",
            d: null,
          },
          {
            cc: 42,
            cn: "ហាត់ប៉ក់",
            d: null,
          },
          {
            cc: 43,
            cn: "កាចូន",
            d: null,
          },
          {
            cc: 44,
            cn: "កោះប៉ង់",
            d: null,
          },
          {
            cc: 45,
            cn: "កោះពាក្យ",
            d: null,
          },
          {
            cc: 46,
            cn: "កុកឡាក់",
            d: null,
          },
          {
            cc: 47,
            cn: "ប៉ាកាឡាន់",
            d: null,
          },
          {
            cc: 48,
            cn: "ភ្នំកុក",
            d: null,
          },
          {
            cc: 49,
            cn: "វើនសៃ",
            d: null,
          },
        ],
      },
    ],
  },
  {
    name: "សៀមរាប ",
    ls: [
      {
        bn: "អង្គរជុំ",
        bc: 1,
        c: [
          {
            cc: 1,
            cn: "ចារឈូក",
            d: null,
          },
          {
            cc: 2,
            cn: "ដូនពេង",
            d: null,
          },
          {
            cc: 3,
            cn: "គោកដូង",
            d: null,
          },
          {
            cc: 4,
            cn: "គោល",
            d: null,
          },
          {
            cc: 5,
            cn: "នគរភាស",
            d: null,
          },
          {
            cc: 6,
            cn: "ស្រែខ្វាវ",
            d: null,
          },
          {
            cc: 7,
            cn: "តាសោម",
            d: null,
          },
        ],
      },
      {
        bn: "អង្គរធំ",
        bc: 2,
        c: [
          {
            cc: 8,
            cn: "ជប់តាត្រាវ",
            d: null,
          },
          {
            cc: 9,
            cn: "លាងដៃ",
            d: null,
          },
          {
            cc: 10,
            cn: "ពាក់ស្នែង",
            d: null,
          },
          {
            cc: 11,
            cn: "ស្វាយចេក",
            d: null,
          },
        ],
      },
      {
        bn: "បន្ទាយស្រី",
        bc: 3,
        c: [
          {
            cc: 12,
            cn: "ខ្នារសណ្តាយ",
            d: null,
          },
          {
            cc: 13,
            cn: "ឃុនរាម",
            d: null,
          },
          {
            cc: 14,
            cn: "ព្រះដាក់",
            d: null,
          },
          {
            cc: 15,
            cn: "រំចេក",
            d: null,
          },
          {
            cc: 16,
            cn: "រុនតាឯក",
            d: null,
          },
          {
            cc: 17,
            cn: "ត្បែង",
            d: null,
          },
        ],
      },
      {
        bn: "ជីក្រែង",
        bc: 4,
        c: [
          {
            cc: 18,
            cn: "អន្លង់សំណរ",
            d: null,
          },
          {
            cc: 19,
            cn: "ជីក្រែង",
            d: null,
          },
          {
            cc: 20,
            cn: "កំពង់ក្តី",
            d: null,
          },
          {
            cc: 21,
            cn: "ខ្វាវ",
            d: null,
          },
          {
            cc: 22,
            cn: "គោកធ្លកក្រោម",
            d: null,
          },
          {
            cc: 23,
            cn: "គោកធ្លកលើ",
            d: null,
          },
          {
            cc: 24,
            cn: "ល្វែងឫស្សី",
            d: null,
          },
          {
            cc: 25,
            cn: "ពង្រក្រោម",
            d: null,
          },
          {
            cc: 26,
            cn: "ពង្រលើ",
            d: null,
          },
          {
            cc: 27,
            cn: "ឫស្សីលក",
            d: null,
          },
          {
            cc: 28,
            cn: "សង្វើយ",
            d: null,
          },
          {
            cc: 29,
            cn: "ស្ពានត្នោត",
            d: null,
          },
        ],
      },
      {
        bn: "ក្រឡាញ់",
        bc: 5,
        c: [
          {
            cc: 30,
            cn: "ចន្លាសដៃ",
            d: null,
          },
          {
            cc: 31,
            cn: "កំពង់ថ្កូវ",
            d: null,
          },
          {
            cc: 32,
            cn: "ក្រឡាញ់",
            d: null,
          },
          {
            cc: 33,
            cn: "ក្រូចគរ",
            d: null,
          },
          {
            cc: 34,
            cn: "រោងគោ",
            d: null,
          },
          {
            cc: 35,
            cn: "សំបួរ",
            d: null,
          },
          {
            cc: 36,
            cn: "សែនសុខ",
            d: null,
          },
          {
            cc: 37,
            cn: "ស្នួល",
            d: null,
          },
          {
            cc: 38,
            cn: "ស្រណាល",
            d: null,
          },
          {
            cc: 39,
            cn: "តាអាន",
            d: null,
          },
        ],
      },
      {
        bn: "ពួក",
        bc: 6,
        c: [
          {
            cc: 40,
            cn: "សសរស្តម្ភ",
            d: null,
          },
          {
            cc: 41,
            cn: "ដូនកែវ",
            d: null,
          },
          {
            cc: 42,
            cn: "ក្តីរុន",
            d: null,
          },
          {
            cc: 43,
            cn: "កែវពណ៌",
            d: null,
          },
          {
            cc: 44,
            cn: "ខ្នាត",
            d: null,
          },
          {
            cc: 46,
            cn: "ល្វា",
            d: null,
          },
          {
            cc: 47,
            cn: "មុខប៉ែន",
            d: null,
          },
          {
            cc: 48,
            cn: "ពោធិ៍ទ្រាយ",
            d: null,
          },
          {
            cc: 49,
            cn: "ពួក",
            d: null,
          },
          {
            cc: 50,
            cn: "ព្រៃជ្រូក",
            d: null,
          },
          {
            cc: 51,
            cn: "រើល",
            d: null,
          },
          {
            cc: 52,
            cn: "សំរោងយា",
            d: null,
          },
          {
            cc: 54,
            cn: "ត្រីញ័រ",
            d: null,
          },
          {
            cc: 55,
            cn: "យាង",
            d: null,
          },
        ],
      },
      {
        bn: "ប្រាសាទបាគង",
        bc: 7,
        c: [
          {
            cc: 56,
            cn: "អំពិល",
            d: null,
          },
          {
            cc: 57,
            cn: "បាគង",
            d: null,
          },
          {
            cc: 58,
            cn: "បល្ល័ង្ក",
            d: null,
          },
          {
            cc: 59,
            cn: "កំពង់ភ្លុក",
            d: null,
          },
          {
            cc: 60,
            cn: "កន្ទ្រាំង",
            d: null,
          },
          {
            cc: 61,
            cn: "កណ្តែក",
            d: null,
          },
          {
            cc: 62,
            cn: "មានជ័យ",
            d: null,
          },
          {
            cc: 63,
            cn: "រលួស",
            d: null,
          },
          {
            cc: 64,
            cn: "ត្រពាំងធំ",
            d: null,
          },
        ],
      },
      {
        bn: "សៀមរាប",
        bc: 8,
        c: [
          {
            cc: 45,
            cn: "ក្របីរៀល",
            d: null,
          },
          {
            cc: 53,
            cn: "ទឹកវិល",
            d: null,
          },
          {
            cc: 65,
            cn: "ស្លក្រាម",
            d: null,
          },
          {
            cc: 66,
            cn: "ស្វាយដង្គំ",
            d: null,
          },
          {
            cc: 67,
            cn: "គោកចក",
            d: null,
          },
          {
            cc: 68,
            cn: "សាលាកំរើក",
            d: null,
          },
          {
            cc: 69,
            cn: "នគរធំ",
            d: null,
          },
          {
            cc: 70,
            cn: "ជ្រាវ",
            d: null,
          },
          {
            cc: 71,
            cn: "ចុងឃ្នៀស",
            d: null,
          },
          {
            cc: 72,
            cn: "សំបួរ",
            d: null,
          },
          {
            cc: 73,
            cn: "សៀមរាប",
            d: null,
          },
          {
            cc: 74,
            cn: "ស្រង៉ែ",
            d: null,
          },
        ],
      },
      {
        bn: "សូទ្រនិគម",
        bc: 9,
        c: [
          {
            cc: 75,
            cn: "ចាន់ស",
            d: null,
          },
          {
            cc: 76,
            cn: "ដំដែក",
            d: null,
          },
          {
            cc: 77,
            cn: "ដានរុន",
            d: null,
          },
          {
            cc: 78,
            cn: "កំពង់ឃ្លាំង",
            d: null,
          },
          {
            cc: 79,
            cn: "កៀនសង្កែ",
            d: null,
          },
          {
            cc: 80,
            cn: "ខ្ចាស់",
            d: null,
          },
          {
            cc: 81,
            cn: "ខ្នារពោធិ៍",
            d: null,
          },
          {
            cc: 82,
            cn: "ពពេល",
            d: null,
          },
          {
            cc: 83,
            cn: "សំរោង",
            d: null,
          },
          {
            cc: 84,
            cn: "តាយ៉ែក",
            d: null,
          },
        ],
      },
      {
        bn: "ស្រីស្នំ",
        bc: 10,
        c: [
          {
            cc: 85,
            cn: "ជ្រោយនាងងួន",
            d: null,
          },
          {
            cc: 86,
            cn: "ក្លាំងហាយ",
            d: null,
          },
          {
            cc: 87,
            cn: "ត្រាំសសរ",
            d: null,
          },
          {
            cc: 88,
            cn: "មោង",
            d: null,
          },
          {
            cc: 89,
            cn: "ប្រីយ៍",
            d: null,
          },
          {
            cc: 90,
            cn: "ស្លែងស្ពាន",
            d: null,
          },
        ],
      },
      {
        bn: "ស្វាយលើ",
        bc: 11,
        c: [
          {
            cc: 91,
            cn: "បឹងមាលា",
            d: null,
          },
          {
            cc: 92,
            cn: "កន្ទួត",
            d: null,
          },
          {
            cc: 93,
            cn: "ខ្នងភ្នំ",
            d: null,
          },
          {
            cc: 94,
            cn: "ស្វាយលើ",
            d: null,
          },
          {
            cc: 95,
            cn: "តាសៀម",
            d: null,
          },
        ],
      },
      {
        bn: "វ៉ារិន",
        bc: 12,
        c: [
          {
            cc: 96,
            cn: "ប្រាសាទ",
            d: null,
          },
          {
            cc: 97,
            cn: "ល្វាក្រាំង",
            d: null,
          },
          {
            cc: 98,
            cn: "ស្រែណូយ",
            d: null,
          },
          {
            cc: 99,
            cn: "ស្វាយ ស",
            d: null,
          },
          {
            cc: 100,
            cn: "វ៉ារិន",
            d: null,
          },
        ],
      },
    ],
  },
  {
    name: "ព្រះសីហនុ",
    ls: [
      {
        bn: "ព្រះសីហនុ",
        bc: 1,
        c: [
          {
            cc: 1,
            cn: "លេខ ១",
            d: null,
          },
          {
            cc: 2,
            cn: "លេខ ២",
            d: null,
          },
          {
            cc: 3,
            cn: "លេខ ៣",
            d: null,
          },
          {
            cc: 4,
            cn: "លេខ ៤",
            d: null,
          },
        ],
      },
      {
        bn: "ព្រៃនប់",
        bc: 2,
        c: [
          {
            cc: 5,
            cn: "អណ្តូងថ្ម",
            d: null,
          },
          {
            cc: 6,
            cn: "បឹងតាព្រហ្ម",
            d: null,
          },
          {
            cc: 7,
            cn: "បិតត្រាំង",
            d: null,
          },
          {
            cc: 8,
            cn: "ជើងគោ",
            d: null,
          },
          {
            cc: 9,
            cn: "អូរជ្រៅ",
            d: null,
          },
          {
            cc: 10,
            cn: "អូរឧកញ៉ាហេង",
            d: null,
          },
          {
            cc: 11,
            cn: "ព្រៃនប់",
            d: null,
          },
          {
            cc: 12,
            cn: "រាម",
            d: null,
          },
          {
            cc: 13,
            cn: "សាមគ្គី",
            d: null,
          },
          {
            cc: 14,
            cn: "សំរុង",
            d: null,
          },
          {
            cc: 15,
            cn: "ទឹកល្អក់",
            d: null,
          },
          {
            cc: 16,
            cn: "ទឹកថ្លា",
            d: null,
          },
          {
            cc: 17,
            cn: "ទួលទទឹង",
            d: null,
          },
          {
            cc: 18,
            cn: "វាលរេញ",
            d: null,
          },
          {
            cc: 26,
            cn: "តានៃ",
            d: null,
          },
        ],
      },
      {
        bn: "ស្ទឹងហាវ",
        bc: 3,
        c: [
          {
            cc: 19,
            cn: "កំពេញ",
            d: null,
          },
          {
            cc: 20,
            cn: "អូរត្រេះ",
            d: null,
          },
          {
            cc: 21,
            cn: "ទំនប់រលក",
            d: null,
          },
          {
            cc: 23,
            cn: "កែវផុស",
            d: null,
          },
        ],
      },
      {
        bn: "កំពង់សីលា",
        bc: 4,
        c: [
          {
            cc: 24,
            cn: "កំពង់សីលា",
            d: null,
          },
          {
            cc: 31,
            cn: "ស្ទឹងឆាយ",
            d: null,
          },
          {
            cc: 32,
            cn: "ចំការហ្លួង",
            d: null,
          },
          {
            cc: 33,
            cn: "អូរបាក់រទេះ",
            d: null,
          },
        ],
      },
      {
        bn: "កោះរ៉ុង",
        bc: 5,
        c: [
          {
            cc: 22,
            cn: "កោះរ៉ុង",
            d: null,
          },
          {
            cc: 25,
            cn: "កោះរ៉ុងសន្លឹម",
            d: null,
          },
        ],
      },
    ],
  },
  {
    name: "ស្ទឹងត្រែង",
    ls: [
      {
        bn: "សេសាន",
        bc: 1,
        c: [
          {
            cc: 1,
            cn: "កំភុន",
            d: null,
          },
          {
            cc: 2,
            cn: "ក្បាលរមាស",
            d: null,
          },
          {
            cc: 3,
            cn: "ភ្លុក",
            d: null,
          },
          {
            cc: 4,
            cn: "សាមឃួយ",
            d: null,
          },
          {
            cc: 5,
            cn: "ស្តៅ",
            d: null,
          },
          {
            cc: 6,
            cn: "ស្រែគរ",
            d: null,
          },
          {
            cc: 7,
            cn: "តាឡាត",
            d: null,
          },
        ],
      },
      {
        bn: "សៀមបូក",
        bc: 2,
        c: [
          {
            cc: 8,
            cn: "កោះព្រះ",
            d: null,
          },
          {
            cc: 9,
            cn: "កោះសំពាយ",
            d: null,
          },
          {
            cc: 10,
            cn: "កោះស្រឡាយ",
            d: null,
          },
          {
            cc: 11,
            cn: "អូរម្រះ",
            d: null,
          },
          {
            cc: 12,
            cn: "អូរឫស្សីកណ្តាល",
            d: null,
          },
          {
            cc: 13,
            cn: "សៀមបូក",
            d: null,
          },
          {
            cc: 14,
            cn: "ស្រែក្រសាំង",
            d: null,
          },
        ],
      },
      {
        bn: "សៀមប៉ាង",
        bc: 3,
        c: [
          {
            cc: 15,
            cn: "ព្រែកមាស",
            d: null,
          },
          {
            cc: 16,
            cn: "សេកុង",
            d: null,
          },
          {
            cc: 17,
            cn: "សន្តិភាព",
            d: null,
          },
          {
            cc: 18,
            cn: "ស្រែសំបូរ",
            d: null,
          },
          {
            cc: 19,
            cn: "ថ្មកែវ",
            d: null,
          },
        ],
      },
      {
        bn: "ស្ទឹងត្រែង",
        bc: 4,
        c: [
          {
            cc: 20,
            cn: "ស្ទឹងត្រែង",
            d: null,
          },
          {
            cc: 21,
            cn: "ស្រះឫស្សី",
            d: null,
          },
          {
            cc: 22,
            cn: "ព្រះបាទ",
            d: null,
          },
          {
            cc: 23,
            cn: "សាមគ្គី",
            d: null,
          },
        ],
      },
      {
        bn: "ថាឡាបរិវ៉ាត់",
        bc: 5,
        c: [
          {
            cc: 24,
            cn: "អន្លង់ភេ",
            d: null,
          },
          {
            cc: 25,
            cn: "ចំការលើ",
            d: null,
          },
          {
            cc: 26,
            cn: "កាំងចាម",
            d: null,
          },
          {
            cc: 28,
            cn: "អន្លង់ជ្រៃ",
            d: null,
          },
          {
            cc: 29,
            cn: "អូររ៉ៃ",
            d: null,
          },
          {
            cc: 32,
            cn: "សំអាង",
            d: null,
          },
          {
            cc: 33,
            cn: "ស្រែឫស្សី",
            d: null,
          },
          {
            cc: 34,
            cn: "ថាឡាបរិវ៉ាត់",
            d: null,
          },
        ],
      },
      {
        bn: "បុរីអូរស្វាយសែនជ័យ",
        bc: 6,
        c: [
          {
            cc: 27,
            cn: "កោះស្នែង",
            d: null,
          },
          {
            cc: 30,
            cn: "អូរស្វាយ",
            d: null,
          },
          {
            cc: 31,
            cn: "ព្រះរំកិល",
            d: null,
          },
        ],
      },
    ],
  },
  {
    name: "ស្វាយរៀង",
    ls: [
      {
        bn: "បាវិត",
        bc: 1,
        c: [
          {
            cc: 1,
            cn: "បាទី",
            d: null,
          },
          {
            cc: 2,
            cn: "បាវិត",
            d: null,
          },
          {
            cc: 6,
            cn: "ប្រាសាទ",
            d: null,
          },
          {
            cc: 7,
            cn: "ព្រៃអង្គុញ",
            d: null,
          },
          {
            cc: 70,
            cn: "ច្រកម្ទេស",
            d: null,
          },
        ],
      },
      {
        bn: "ចន្ទ្រា",
        bc: 2,
        c: [
          {
            cc: 3,
            cn: "ចន្ទ្រា",
            d: null,
          },
          {
            cc: 4,
            cn: "ច្រេស",
            d: null,
          },
          {
            cc: 5,
            cn: "មេសរថ្ងក",
            d: null,
          },
          {
            cc: 8,
            cn: "ព្រៃគគីរ",
            d: null,
          },
          {
            cc: 9,
            cn: "សំរោង",
            d: null,
          },
          {
            cc: 10,
            cn: "ទួលស្តី",
            d: null,
          },
        ],
      },
      {
        bn: "កំពង់រោទិ៍",
        bc: 3,
        c: [
          {
            cc: 11,
            cn: "បន្ទាយក្រាំង",
            d: null,
          },
          {
            cc: 12,
            cn: "ញរ",
            d: null,
          },
          {
            cc: 13,
            cn: "ខ្សែត្រ",
            d: null,
          },
          {
            cc: 14,
            cn: "ព្រះពន្លា",
            d: null,
          },
          {
            cc: 15,
            cn: "ព្រៃធំ",
            d: null,
          },
          {
            cc: 16,
            cn: "រាជមន្ទីរ",
            d: null,
          },
          {
            cc: 17,
            cn: "សំឡី",
            d: null,
          },
          {
            cc: 18,
            cn: "សំយ៉ោង",
            d: null,
          },
          {
            cc: 19,
            cn: "ស្វាយតាយាន",
            d: null,
          },
          {
            cc: 21,
            cn: "ថ្មី",
            d: null,
          },
          {
            cc: 22,
            cn: "ត្នោត",
            d: null,
          },
        ],
      },
      {
        bn: "រំដួល",
        bc: 4,
        c: [
          {
            cc: 23,
            cn: "បុសមន",
            d: null,
          },
          {
            cc: 24,
            cn: "ធ្មា",
            d: null,
          },
          {
            cc: 25,
            cn: "កំពង់ចក",
            d: null,
          },
          {
            cc: 26,
            cn: "ជ្រុងពពេល",
            d: null,
          },
          {
            cc: 27,
            cn: "កំពង់អំពិល",
            d: null,
          },
          {
            cc: 28,
            cn: "ម៉ឺនជ័យ",
            d: null,
          },
          {
            cc: 29,
            cn: "ពងទឹក",
            d: null,
          },
          {
            cc: 30,
            cn: "សង្កែ",
            d: null,
          },
          {
            cc: 31,
            cn: "ស្វាយចេក",
            d: null,
          },
          {
            cc: 32,
            cn: "ថ្នាធ្នង់",
            d: null,
          },
        ],
      },
      {
        bn: "រមាសហែក",
        bc: 5,
        c: [
          {
            cc: 33,
            cn: "អំពិល",
            d: null,
          },
          {
            cc: 34,
            cn: "អណ្តូងពោធិ៍",
            d: null,
          },
          {
            cc: 35,
            cn: "អណ្តូងត្របែក",
            d: null,
          },
          {
            cc: 36,
            cn: "អង្គប្រស្រែ",
            d: null,
          },
          {
            cc: 37,
            cn: "ចន្ត្រី",
            d: null,
          },
          {
            cc: 38,
            cn: "ជ្រៃធំ",
            d: null,
          },
          {
            cc: 39,
            cn: "ដូង",
            d: null,
          },
          {
            cc: 40,
            cn: "កំពង់ត្រាច",
            d: null,
          },
          {
            cc: 41,
            cn: "គគីរ",
            d: null,
          },
          {
            cc: 42,
            cn: "ក្រសាំង",
            d: null,
          },
          {
            cc: 43,
            cn: "មុខដា",
            d: null,
          },
          {
            cc: 44,
            cn: "ម្រាម",
            d: null,
          },
          {
            cc: 45,
            cn: "សំបួរ",
            d: null,
          },
          {
            cc: 46,
            cn: "សម្បត្តិមានជ័យ",
            d: null,
          },
          {
            cc: 47,
            cn: "ត្រពាំងស្តៅ",
            d: null,
          },
          {
            cc: 48,
            cn: "ត្រស់",
            d: null,
          },
        ],
      },
      {
        bn: "ស្វាយជ្រំ",
        bc: 6,
        c: [
          {
            cc: 49,
            cn: "អង្គតាសូ",
            d: null,
          },
          {
            cc: 50,
            cn: "បាសាក់",
            d: null,
          },
          {
            cc: 51,
            cn: "ចំបក់",
            d: null,
          },
          {
            cc: 52,
            cn: "កំពង់ចំឡង",
            d: null,
          },
          {
            cc: 53,
            cn: "តាសួស",
            d: null,
          },
          {
            cc: 55,
            cn: "ឈើទាល",
            d: null,
          },
          {
            cc: 56,
            cn: "ដូន ស",
            d: null,
          },
          {
            cc: 57,
            cn: "គោកព្រីង",
            d: null,
          },
          {
            cc: 58,
            cn: "ក្រោលគោ",
            d: null,
          },
          {
            cc: 59,
            cn: "គ្រួស",
            d: null,
          },
          {
            cc: 60,
            cn: "ពោធិរាជ",
            d: null,
          },
          {
            cc: 61,
            cn: "ស្វាយអង្គ",
            d: null,
          },
          {
            cc: 62,
            cn: "ស្វាយជ្រំ",
            d: null,
          },
          {
            cc: 63,
            cn: "ស្វាយធំ",
            d: null,
          },
          {
            cc: 64,
            cn: "ស្វាយយា",
            d: null,
          },
          {
            cc: 65,
            cn: "ធ្លក",
            d: null,
          },
        ],
      },
      {
        bn: "ស្វាយរៀង",
        bc: 7,
        c: [
          {
            cc: 20,
            cn: "ស្វាយតឿ",
            d: null,
          },
          {
            cc: 54,
            cn: "ចេក",
            d: null,
          },
          {
            cc: 66,
            cn: "ស្វាយរៀង",
            d: null,
          },
          {
            cc: 67,
            cn: "ព្រៃឆ្លាក់",
            d: null,
          },
          {
            cc: 68,
            cn: "គយត្របែក",
            d: null,
          },
          {
            cc: 69,
            cn: "ពោធិ៍តាហោ",
            d: null,
          },
          {
            cc: 79,
            cn: "សង្ឃ័រ",
            d: null,
          },
        ],
      },
      {
        bn: "ស្វាយទាប",
        bc: 8,
        c: [
          {
            cc: 71,
            cn: "គគីសោម",
            d: null,
          },
          {
            cc: 72,
            cn: "កណ្តៀងរាយ",
            d: null,
          },
          {
            cc: 73,
            cn: "មនោរម្យ",
            d: null,
          },
          {
            cc: 74,
            cn: "ពពែត",
            d: null,
          },
          {
            cc: 75,
            cn: "ព្រៃតាអី",
            d: null,
          },
          {
            cc: 76,
            cn: "ប្រសូត្រ",
            d: null,
          },
          {
            cc: 77,
            cn: "រមាំងថ្កោល",
            d: null,
          },
          {
            cc: 78,
            cn: "សំបួរ",
            d: null,
          },
          {
            cc: 80,
            cn: "ស្វាយរំពារ",
            d: null,
          },
        ],
      },
    ],
  },
  {
    name: "តាកែវ",
    ls: [
      {
        bn: "អង្គរបូរី",
        bc: 1,
        c: [
          {
            cc: 1,
            cn: "អង្គរបូរី",
            d: null,
          },
          {
            cc: 2,
            cn: "បាស្រែ",
            d: null,
          },
          {
            cc: 3,
            cn: "គោកធ្លក",
            d: null,
          },
          {
            cc: 4,
            cn: "ពន្លៃ",
            d: null,
          },
          {
            cc: 5,
            cn: "ព្រែកផ្ទោល",
            d: null,
          },
          {
            cc: 6,
            cn: "ព្រៃផ្គាំ",
            d: null,
          },
        ],
      },
      {
        bn: "បាទី",
        bc: 2,
        c: [
          {
            cc: 7,
            cn: "ចំបក់",
            d: null,
          },
          {
            cc: 8,
            cn: "ចំប៉ី",
            d: null,
          },
          {
            cc: 9,
            cn: "ដូង",
            d: null,
          },
          {
            cc: 10,
            cn: "កណ្តឹង",
            d: null,
          },
          {
            cc: 11,
            cn: "កុមាររាជា",
            d: null,
          },
          {
            cc: 12,
            cn: "ក្រាំងលាវ",
            d: null,
          },
          {
            cc: 13,
            cn: "ក្រាំងធ្នង់",
            d: null,
          },
          {
            cc: 14,
            cn: "លំពង់",
            d: null,
          },
          {
            cc: 15,
            cn: "ពារាម",
            d: null,
          },
          {
            cc: 16,
            cn: "ពត់សរ",
            d: null,
          },
          {
            cc: 17,
            cn: "សូរភី",
            d: null,
          },
          {
            cc: 18,
            cn: "តាំងដូង",
            d: null,
          },
          {
            cc: 19,
            cn: "ត្នោត",
            d: null,
          },
          {
            cc: 20,
            cn: "ត្រពាំងក្រសាំង",
            d: null,
          },
          {
            cc: 21,
            cn: "ត្រពាំងសាប",
            d: null,
          },
        ],
      },
      {
        bn: "បូរីជលសារ",
        bc: 3,
        c: [
          {
            cc: 22,
            cn: "បូរីជលសារ",
            d: null,
          },
          {
            cc: 23,
            cn: "ជ័យជោគ",
            d: null,
          },
          {
            cc: 24,
            cn: "ដូងខ្ពស់",
            d: null,
          },
          {
            cc: 25,
            cn: "កំពង់ក្រសាំង",
            d: null,
          },
          {
            cc: 26,
            cn: "គោកពោធិ៍",
            d: null,
          },
        ],
      },
      {
        bn: "គិរីវង់",
        bc: 4,
        c: [
          {
            cc: 27,
            cn: "អង្គប្រាសាទ",
            d: null,
          },
          {
            cc: 28,
            cn: "ព្រះបាទជាន់ជុំ",
            d: null,
          },
          {
            cc: 29,
            cn: "កំណប់",
            d: null,
          },
          {
            cc: 30,
            cn: "កំពែង",
            d: null,
          },
          {
            cc: 31,
            cn: "គិរីចុងកោះ",
            d: null,
          },
          {
            cc: 32,
            cn: "គោកព្រេច",
            d: null,
          },
          {
            cc: 33,
            cn: "ភ្នំដិន",
            d: null,
          },
          {
            cc: 34,
            cn: "ព្រៃអំពក",
            d: null,
          },
          {
            cc: 35,
            cn: "ព្រៃរំដេង",
            d: null,
          },
          {
            cc: 36,
            cn: "រាមអណ្តើក",
            d: null,
          },
          {
            cc: 37,
            cn: "សោម",
            d: null,
          },
          {
            cc: 38,
            cn: "តាអូរ",
            d: null,
          },
        ],
      },
      {
        bn: "កោះអណ្តែត",
        bc: 5,
        c: [
          {
            cc: 39,
            cn: "ក្រពុំឈូក",
            d: null,
          },
          {
            cc: 40,
            cn: "ពេជសារ",
            d: null,
          },
          {
            cc: 41,
            cn: "ព្រៃខ្លា",
            d: null,
          },
          {
            cc: 42,
            cn: "ព្រៃយុថ្កា",
            d: null,
          },
          {
            cc: 43,
            cn: "រមេញ",
            d: null,
          },
          {
            cc: 44,
            cn: "ធ្លាប្រជុំ",
            d: null,
          },
        ],
      },
      {
        bn: "ព្រៃកប្បាស",
        bc: 6,
        c: [
          {
            cc: 45,
            cn: "អង្កាញ់",
            d: null,
          },
          {
            cc: 46,
            cn: "បានកាម",
            d: null,
          },
          {
            cc: 47,
            cn: "ចំប៉ា",
            d: null,
          },
          {
            cc: 48,
            cn: "ចារ",
            d: null,
          },
          {
            cc: 49,
            cn: "កំពែង",
            d: null,
          },
          {
            cc: 50,
            cn: "កំពង់រាប",
            d: null,
          },
          {
            cc: 51,
            cn: "ក្តាញ់",
            d: null,
          },
          {
            cc: 52,
            cn: "ពោធិ៍រំចាក",
            d: null,
          },
          {
            cc: 53,
            cn: "ព្រៃកប្បាស",
            d: null,
          },
          {
            cc: 54,
            cn: "ព្រៃល្វា",
            d: null,
          },
          {
            cc: 55,
            cn: "ព្រៃផ្តៅ",
            d: null,
          },
          {
            cc: 56,
            cn: "ស្នោ",
            d: null,
          },
          {
            cc: 57,
            cn: "តាំងយ៉ាប",
            d: null,
          },
        ],
      },
      {
        bn: "សំរោង",
        bc: 7,
        c: [
          {
            cc: 58,
            cn: "បឹងត្រាញ់ខាងជើង",
            d: null,
          },
          {
            cc: 59,
            cn: "បឹងត្រាញ់ខាងត្បូង",
            d: null,
          },
          {
            cc: 60,
            cn: "ជើងគួន",
            d: null,
          },
          {
            cc: 61,
            cn: "ជំរះពេន",
            d: null,
          },
          {
            cc: 62,
            cn: "ខ្វាវ",
            d: null,
          },
          {
            cc: 63,
            cn: "លំចង់",
            d: null,
          },
          {
            cc: 64,
            cn: "រវៀង",
            d: null,
          },
          {
            cc: 65,
            cn: "សំរោង",
            d: null,
          },
          {
            cc: 66,
            cn: "សឹង្ហ",
            d: null,
          },
          {
            cc: 67,
            cn: "ស្លា",
            d: null,
          },
          {
            cc: 68,
            cn: "ទ្រា",
            d: null,
          },
        ],
      },
      {
        bn: "ដូនកែវ",
        bc: 8,
        c: [
          {
            cc: 69,
            cn: "បារាយណ៍",
            d: null,
          },
          {
            cc: 70,
            cn: "រកាក្នុង",
            d: null,
          },
          {
            cc: 71,
            cn: "រកាក្រៅ",
            d: null,
          },
        ],
      },
      {
        bn: "ត្រាំកក់",
        bc: 9,
        c: [
          {
            cc: 72,
            cn: "អង្គតាសោម",
            d: null,
          },
          {
            cc: 73,
            cn: "ជាងទង",
            d: null,
          },
          {
            cc: 74,
            cn: "គុស",
            d: null,
          },
          {
            cc: 75,
            cn: "លាយបូរ",
            d: null,
          },
          {
            cc: 76,
            cn: "ញ៉ែងញ៉ង",
            d: null,
          },
          {
            cc: 77,
            cn: "អូរសារាយ",
            d: null,
          },
          {
            cc: 78,
            cn: "ឧត្តមសុរិយា",
            d: null,
          },
          {
            cc: 79,
            cn: "ពពេល",
            d: null,
          },
          {
            cc: 80,
            cn: "សំរោង",
            d: null,
          },
          {
            cc: 81,
            cn: "ស្រែរនោង",
            d: null,
          },
          {
            cc: 82,
            cn: "តាភេម",
            d: null,
          },
          {
            cc: 83,
            cn: "ត្រាំកក់",
            d: null,
          },
          {
            cc: 84,
            cn: "ត្រពាំងធំខាងជើង",
            d: null,
          },
          {
            cc: 85,
            cn: "ត្រពាំងធំខាងត្បូង",
            d: null,
          },
          {
            cc: 99,
            cn: "ត្រពាំងក្រញូង",
            d: null,
          },
        ],
      },
      {
        bn: "ទ្រាំង",
        bc: 10,
        c: [
          {
            cc: 86,
            cn: "អង្កាញ់",
            d: null,
          },
          {
            cc: 87,
            cn: "អង្គខ្នុរ",
            d: null,
          },
          {
            cc: 88,
            cn: "ជីខ្មា",
            d: null,
          },
          {
            cc: 89,
            cn: "ខ្វាវ",
            d: null,
          },
          {
            cc: 90,
            cn: "ប្រាំបីមុំ",
            d: null,
          },
          {
            cc: 91,
            cn: "ព្រៃស្លឹក",
            d: null,
          },
          {
            cc: 92,
            cn: "រនាម",
            d: null,
          },
          {
            cc: 93,
            cn: "សំបួរ",
            d: null,
          },
          {
            cc: 94,
            cn: "សន្លុង",
            d: null,
          },
          {
            cc: 95,
            cn: "ស្មោង",
            d: null,
          },
          {
            cc: 96,
            cn: "ស្រង៉ែ",
            d: null,
          },
          {
            cc: 97,
            cn: "ធ្លក",
            d: null,
          },
          {
            cc: 98,
            cn: "ត្រឡាច",
            d: null,
          },
          {
            cc: 100,
            cn: "អង្គកែវ",
            d: null,
          },
        ],
      },
    ],
  },
  {
    name: "កែប",
    ls: [
      {
        bn: "ដំណាក់ចង្អើរ",
        bc: 1,
        c: [
          {
            cc: 1,
            cn: "អង្កោល",
            d: null,
          },
          {
            cc: 3,
            cn: "ពងទឹក",
            d: null,
          },
        ],
      },
      {
        bn: "កែប",
        bc: 2,
        c: [
          {
            cc: 2,
            cn: "អូរក្រសារ",
            d: null,
          },
          {
            cc: 4,
            cn: "កែប",
            d: null,
          },
          {
            cc: 5,
            cn: "ព្រៃធំ",
            d: null,
          },
        ],
      },
    ],
  },
  {
    name: "ប៉ៃលិន",
    ls: [
      {
        bn: "ប៉ៃលិន",
        bc: 1,
        c: [
          {
            cc: 1,
            cn: "ប៉ៃលិន",
            d: null,
          },
          {
            cc: 2,
            cn: "អូរតាវ៉ៅ",
            d: null,
          },
          {
            cc: 3,
            cn: "ទួលល្វា",
            d: null,
          },
          {
            cc: 4,
            cn: "បយ៉ាខា",
            d: null,
          },
        ],
      },
      {
        bn: "សាលាក្រៅ",
        bc: 2,
        c: [
          {
            cc: 5,
            cn: "សាលាក្រៅ",
            d: null,
          },
          {
            cc: 6,
            cn: "ស្ទឹងត្រង់",
            d: null,
          },
          {
            cc: 7,
            cn: "ស្ទឹងកាច់",
            d: null,
          },
          {
            cc: 8,
            cn: "អូរអណ្តូង",
            d: null,
          },
        ],
      },
    ],
  },
  {
    name: "ឧត្តរមានជ័យ",
    ls: [
      {
        bn: "អន្លង់វែង",
        bc: 1,
        c: [
          {
            cc: 1,
            cn: "អន្លង់វែង",
            d: null,
          },
          {
            cc: 2,
            cn: "លំទង",
            d: null,
          },
          {
            cc: 3,
            cn: "ផ្លាត",
            d: null,
          },
          {
            cc: 4,
            cn: "ត្រពាំងប្រីយ៍",
            d: null,
          },
          {
            cc: 5,
            cn: "ត្រពាំងតាវ   ",
            d: null,
          },
        ],
      },
      {
        bn: "បន្ទាយអំពិល",
        bc: 2,
        c: [
          {
            cc: 6,
            cn: "អំពិល",
            d: null,
          },
          {
            cc: 7,
            cn: "បេង",
            d: null,
          },
          {
            cc: 8,
            cn: "គោកខ្ពស់",
            d: null,
          },
          {
            cc: 9,
            cn: "គោកមន",
            d: null,
          },
        ],
      },
      {
        bn: "ចុងកាល់",
        bc: 3,
        c: [
          {
            cc: 10,
            cn: "ជើងទៀន",
            d: null,
          },
          {
            cc: 11,
            cn: "ចុងកាល់",
            d: null,
          },
          {
            cc: 12,
            cn: "ក្រសាំង",
            d: null,
          },
          {
            cc: 13,
            cn: "ពង្រ",
            d: null,
          },
        ],
      },
      {
        bn: "សំរោង",
        bc: 4,
        c: [
          {
            cc: 14,
            cn: "បន្សាយរាក់",
            d: null,
          },
          {
            cc: 15,
            cn: "បុស្បូវ",
            d: null,
          },
          {
            cc: 16,
            cn: "កូនគ្រៀល",
            d: null,
          },
          {
            cc: 17,
            cn: "អូរស្មាច់",
            d: null,
          },
          {
            cc: 18,
            cn: "សំរោង",
            d: null,
          },
        ],
      },
      {
        bn: "ត្រពាំងប្រាសាទ",
        bc: 5,
        c: [
          {
            cc: 19,
            cn: "បាក់អន្លូង",
            d: null,
          },
          {
            cc: 20,
            cn: "អូរស្វាយ",
            d: null,
          },
          {
            cc: 21,
            cn: "ផ្អាវ",
            d: null,
          },
          {
            cc: 22,
            cn: "ព្រះប្រឡាយ",
            d: null,
          },
          {
            cc: 23,
            cn: "ត្រពាំងប្រាសាទ",
            d: null,
          },
          {
            cc: 24,
            cn: "ទំនប់ដាច់",
            d: null,
          },
        ],
      },
    ],
  },
  {
    name: "ត្បូងឃ្មុំ",
    ls: [
      {
        bn: "តំបែរ",
        bc: 1,
        c: [
          {
            cc: 1,
            cn: "ចុងជាច",
            d: null,
          },
          {
            cc: 2,
            cn: "តំបែរ",
            d: null,
          },
          {
            cc: 3,
            cn: "គោកស្រុក",
            d: null,
          },
          {
            cc: 4,
            cn: "នាងទើត",
            d: null,
          },
          {
            cc: 5,
            cn: "សេដា",
            d: null,
          },
          {
            cc: 6,
            cn: "ទឹកជ្រៅ",
            d: null,
          },
          {
            cc: 7,
            cn: "ត្រពាំងព្រីង",
            d: null,
          },
        ],
      },
      {
        bn: "ក្រូចឆ្មារ",
        bc: 2,
        c: [
          {
            cc: 8,
            cn: "ឈូក",
            d: null,
          },
          {
            cc: 9,
            cn: "ជំនីក",
            d: null,
          },
          {
            cc: 10,
            cn: "កំពង់ទ្រាស",
            d: null,
          },
          {
            cc: 11,
            cn: "កោះពីរ",
            d: null,
          },
          {
            cc: 12,
            cn: "ក្រូចឆ្មារ",
            d: null,
          },
          {
            cc: 13,
            cn: "ប៉ឺស ១",
            d: null,
          },
          {
            cc: 14,
            cn: "ប៉ឺស ២",
            d: null,
          },
          {
            cc: 15,
            cn: "ព្រែកអាជី",
            d: null,
          },
          {
            cc: 16,
            cn: "រការខ្នុរ",
            d: null,
          },
          {
            cc: 17,
            cn: "ស្វាយឃ្លាំង",
            d: null,
          },
          {
            cc: 18,
            cn: "ទ្រា",
            d: null,
          },
          {
            cc: 19,
            cn: "ទួលស្នួល",
            d: null,
          },
        ],
      },
      {
        bn: "មេមត់",
        bc: 3,
        c: [
          {
            cc: 20,
            cn: "ចាន់មូល",
            d: null,
          },
          {
            cc: 21,
            cn: "ជាំ",
            d: null,
          },
          {
            cc: 22,
            cn: "ជាំក្រវៀន",
            d: null,
          },
          {
            cc: 23,
            cn: "ជាំតាម៉ៅ",
            d: null,
          },
          {
            cc: 24,
            cn: "ដារ",
            d: null,
          },
          {
            cc: 25,
            cn: "កំពាន់",
            d: null,
          },
          {
            cc: 26,
            cn: "មេមង",
            d: null,
          },
          {
            cc: 27,
            cn: "មេមត់",
            d: null,
          },
          {
            cc: 28,
            cn: "រូង",
            d: null,
          },
          {
            cc: 29,
            cn: "រំចេក",
            d: null,
          },
          {
            cc: 30,
            cn: "ត្រមូង",
            d: null,
          },
          {
            cc: 31,
            cn: "ទន្លូង",
            d: null,
          },
          {
            cc: 32,
            cn: "ទ្រៀក",
            d: null,
          },
          {
            cc: 33,
            cn: "គគីរ",
            d: null,
          },
        ],
      },
      {
        bn: "អូររាំងឪ",
        bc: 4,
        c: [
          {
            cc: 34,
            cn: "អំពិលតាពក",
            d: null,
          },
          {
            cc: 35,
            cn: "ចក",
            d: null,
          },
          {
            cc: 36,
            cn: "ដំរិល",
            d: null,
          },
          {
            cc: 37,
            cn: "គងជ័យ",
            d: null,
          },
          {
            cc: 38,
            cn: "មៀន",
            d: null,
          },
          {
            cc: 39,
            cn: "ព្រះធាតុ",
            d: null,
          },
          {
            cc: 40,
            cn: "ទួលសូភី",
            d: null,
          },
        ],
      },
      {
        bn: "ពញាក្រែក",
        bc: 5,
        c: [
          {
            cc: 41,
            cn: "ដូនតី",
            d: null,
          },
          {
            cc: 42,
            cn: "កក់",
            d: null,
          },
          {
            cc: 43,
            cn: "កណ្តោលជ្រុំ",
            d: null,
          },
          {
            cc: 44,
            cn: "កោងកាង",
            d: null,
          },
          {
            cc: 45,
            cn: "ក្រែក",
            d: null,
          },
          {
            cc: 46,
            cn: "ពពេល",
            d: null,
          },
          {
            cc: 47,
            cn: "ត្រពាំងផ្លុង",
            d: null,
          },
          {
            cc: 48,
            cn: "វាលម្លូរ",
            d: null,
          },
        ],
      },
      {
        bn: "ត្បូងឃ្មុំ",
        bc: 6,
        c: [
          {
            cc: 49,
            cn: "អញ្ចើម",
            d: null,
          },
          {
            cc: 50,
            cn: "បឹងព្រួល",
            d: null,
          },
          {
            cc: 51,
            cn: "ជីគរ",
            d: null,
          },
          {
            cc: 52,
            cn: "ជីរោទ៍ទី ១",
            d: null,
          },
          {
            cc: 53,
            cn: "ជីរោទ៍ទី ២",
            d: null,
          },
          {
            cc: 54,
            cn: "ជប់",
            d: null,
          },
          {
            cc: 55,
            cn: "គរ",
            d: null,
          },
          {
            cc: 56,
            cn: "ល្ងៀង",
            d: null,
          },
          {
            cc: 57,
            cn: "មង់រៀវ",
            d: null,
          },
          {
            cc: 58,
            cn: "ពាមជីលាំង",
            d: null,
          },
          {
            cc: 59,
            cn: "រកា ពប្រាំ",
            d: null,
          },
          {
            cc: 60,
            cn: "ស្រឡប់",
            d: null,
          },
          {
            cc: 61,
            cn: "ថ្មពេជ្រ",
            d: null,
          },
          {
            cc: 62,
            cn: "ទន្លេបិទ",
            d: null,
          },
        ],
      },
      {
        bn: "សួង",
        bc: 7,
        c: [
          {
            cc: 63,
            cn: "សួង",
            d: null,
          },
          {
            cc: 64,
            cn: "វិហារលួង",
            d: null,
          },
        ],
      },
    ],
  },
];
