export default [
  {
    value: "មជ្ឈមណ្ឌលថែទាំនិងស្តារនីតិសម្បទាជនវីបល្លាសស្មារតី",
    label: "មជ្ឈមណ្ឌលថែទាំនិងស្តារនីតិសម្បទាជនវីបល្លាសស្មារតី",
  },
  {
    value: "មជ្ឈមណ្ឌលជាតិព្យាបាលនិងស្តារសម្បទាអ្នកញៀនគ្រឿងញៀន",
    label: "មជ្ឈមណ្ឌលជាតិព្យាបាលនិងស្តារសម្បទាអ្នកញៀនគ្រឿងញៀន",
  },
  {
    value:
      "មជ្ឈមណ្ឌលជាតិព្យាបាលនិងស្តារសម្បទាអ្នកញៀនគ្រឿងញៀនដោយស្ម័គ្រចិត្តនិងផ្អែកលើសហគមន៍",
    label:
      "មជ្ឈមណ្ឌលជាតិព្យាបាលនិងស្តារសម្បទាអ្នកញៀនគ្រឿងញៀនដោយស្ម័គ្រចិត្តនិងផ្អែកលើសហគមន៍",
  },
  {
    value: "មជ្ឈមណ្ឌលសំចត",
    label: "មជ្ឈមណ្ឌលសំចត",
  },
  {
    value: "មជ្ឈមណ្ឌលស្តាលទ្ធភាពពលកម្ម",
    label: "មជ្ឈមណ្ឌលស្តាលទ្ធភាពពលកម្ម",
  },
  {
    value: "មជ្ឈមណ្ឌលគ្រឿងញៀន",
    label: "មជ្ឈមណ្ឌលគ្រឿងញៀន",
  },
  {
    value: "មជ្ឈមណ្ឌលកុមារកំព្រា",
    label: "មជ្ឈមណ្ឌលកុមារកំព្រា",
  },
];
